[
	{
		"Representative": "Mario Samuel de Leon III",
		"Organization": "FIT",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1sEIq9xknUZms4dIcq8vicaz6kw8r280U",
		"Description": "FIT is your friendly community of mentors and friends who help you achieve your fitness goals",
		"Advocacy": "To build strong community through fitness, nutrition, and belonging. ",
		"Vision": "We envision a strong and devoted fitness community that supports everyone’s goal of self-improvement no matter what stage of fitness they’re in and has complete access to the proper tools and knowledge for their goals.",
		"Mission": "Our mission is to provide programs, diet plans and support that every fitness enthusiast or gym goer needs through projects and team building activities geared to promote a health and wellness to its community",
		"Application Process": "Interviews",
		"Featured": "FIT Interviews and online workouts",
		"Photos for each event": null,
		"Tagline": "Your community for fitness and wellness",
		"Org Photo": null,
		"Benefits": null,
		"Flagships": "Fitness and Nutrition Mentorship Programs",
		"Departments": "Marketing, Human Resources, Finance, Sec Gen, Externals, Fitness & Nutrition, ",
		"Facebook": "https://web.facebook.com/FITteamCommunity",
		"SocMed Handles": "IG: @fitnessimprovementteam"
	},
	{
		"Representative": "Luis IV de la Vega",
		"Organization": "Blue Bird Improv",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1cjOnBQsHgYRjpcCO5fy2UQQqUrqC7jia",
		"Description": "Blue Bird Improv aims to provide specialized training sessions and workshops to develop the improvisational skills of both members and non-members and promote personal growth. We host shows and events that showcase the skills of our members and provide an avenue to bring entertainment to the greater community. Through this, we wish to create spaces where anyone is welcome to come as the most authentic version of themselves, because anyone can do improv!",
		"Advocacy": "Authenticity Through Improvisation",
		"Vision": "Blue Bird Improv seeks to introduce improvisation as a means for self-improvement inside the Ateneo campus. We seek to form confident and collaborative communicators in our members, who are at the same time capable of bringing out those values and skills in others. We also seek to bring more openness and enthusiasm to the campus and beyond through our shows and workshops. ",
		"Mission": "Blue Bird Improv aims to provide specialized trainings and workshops to develop the improvisational skills of both members and non-members and promote personal growth. We  host shows and events that showcase the skills of our members and provide an avenue to bring entertainment to the greater community. Through this, we wish to create spaces where anyone is welcome to come as the most authentic version of themselves because anyone can do improv.",
		"Application Process": "Just registration fee",
		"Featured": "Birdies Authentic Self-Improvment Course (BASIC): Training sessions for our new members where we teach you the basics of improv, culminating in an optional show\n\nMiscellaneous Improv Shows: Improv shows featuring various members and groups trained by Blue Bird Improv, including our very own House Team\n\nOpen Workshops: A workshop for open to everyone in Ateneo to get a small taste of improv ",
		"Photos for each event": null,
		"Tagline": "Be your most authentic self.",
		"Org Photo": null,
		"Benefits": null,
		"Flagships": "Birdies Authentic Self-Improvment Course (BASIC): Training sessions for our new members where we teach you the basics of improv, culminating in an optional show\n\nMiscellaneous Improv Shows: Improv shows featuring various members and groups trained by Blue Bird Improv, including our very own House Team\n\nOpen Workshops: A workshop for open to everyone in Ateneo to get a small taste of improv ",
		"Departments": "Sessions Team: When you join the org, you will be automatically assigned a team who you will be with for your whole BASIC journey\n\nCreatives: Make promotional material for the org\n\nHouse Team: At the end of the year, you may be able to apply for the Blue Bird House Team, main cast of the org\n\nCoaching and Performance Organizer (CAPO):  At the end of the year, you may be able to apply for a CAPO, the ones who are training people in the sessions",
		"Facebook": "https://www.facebook.com/bluebirdimprov/",
		"SocMed Handles": null
	},
	{
		"Representative": "Hannah Asis",
		"Organization": "Toushin",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1AaCSTTMGJHGUIJyp9xxnDNiFK8ngtjqM",
		"Description": "Toushin (also known as Touhou no Shinju or Pearl of the Orient) is an independent student organization dedicated to promoting Japanese art and pop culture. ",
		"Advocacy": "We are committed towards developing the artistic skills and holistic growth of our members through different avenues and events such as cosplay and art workshops, exhibits, conventions, and other similar events.",
		"Vision": "Toushin seeks to build among its members and the Loyola Schools an organization that is passionate for Japanese arts and contemporary culture, setting aside all differences to create a peaceful and accepting environment favorable of experiential growth and fun.",
		"Mission": "Toushin seeks to build among its members and the Loyola Schools an organization that is passionate for Japanese arts and contemporary culture, setting aside all differences to create a peaceful and accepting environment favorable of experiential growth and fun.",
		"Application Process": "To apply to our org, simply fill out this form :D\nhttps://forms.gle/c68LtFLmUuvcbhgP6",
		"Featured": "Amai Kissaten* - one of our flagship events, held annually, where we dress up as our favorite characters and serve good food and drink! It's a cosplay cafe!\nTouCon* - short for Toushin Convention, it's one of our flagship events, held every two years, where we support multiple indie artists in our community! Featuring live performances and fun games!\nTambay WEEB - a week long WEEB-SAFE event where you can hang out with good food, good games, and good company!!\nFilm Viewing - once a month, you get to watch a movie with our TOMODACHI!! And the best part? YOU get to choose which one!! :3\n*due to the effects of COVID-19, events marked with an * will not push through this year",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1piblv1q2c1FrT6LqJUiuma933S0ciukZ;https://drive.google.com/u/2/open?usp=forms_web&id=17lQUzMmFNlS5T4h9m5gbhkbzj8IwyU_8;https://drive.google.com/u/2/open?usp=forms_web&id=1wOL-ayygx_5VSlzOJ9d1DNIcXO3fA_Jf;https://drive.google.com/u/2/open?usp=forms_web&id=1KYAt8NgJVzRGP7mpKxMJ_H-UupDFXCh0",
		"Tagline": "Let's get GENKI!!",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1FcVqkYpKzzvPL6SI5CnmAr3NK1fO4zOb",
		"Benefits": "Toushin is not just an organization. It is a family of people who are passionate about what they love in the form of Japanese Pop Culture. The various stories that they tell, the characters that gain our interest and make us fall in love, as well as different worlds where we could explore and be different, but the same; all of these are just the tip of the iceberg. If you have interest or passion for anime, manga, and other parts of Japanese Pop Culture, then Toushin can be your home. Okaerinasai, TOUmodachi!!",
		"Flagships": "Amai Kissaten* - one of our flagship events, held annually, where we dress up as our favorite characters and serve good food and drink! It's a cosplay cafe!\nTouCon* - short for Toushin Convention, it's one of our flagship events, held every two years, where we support multiple indie artists in our community! Featuring live performances and fun games!\n*due to the effects of COVID-19, the flagship projects will not push through this year",
		"Departments": "Ministry of Arts - showers members with their amazing art!! Also in charge of promos and sponsor art.\nMinistry of Events - handles all logistics with setting up events (excluding flagship projects)\nMinistry of Externals - manages all relationships with external parties such as potential sponsors and other orgs\nMinistry of Finance - manages the budget of the organization and serves as the org treasury\nMinistry of Internals - manages all internal relationships, especially inter-member relations",
		"Facebook": "https://www.facebook.com/toushin.org/",
		"SocMed Handles": "https://twitter.com/Toushinkun"
	},
	{
		"Representative": "Isabelle Louise R. Obcena",
		"Organization": "Blue Hanguk Society",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=13q1GD_GvNcp8X3t8RRCqWeziquMNm7g5",
		"Description": "Blue Hanguk Society is a student organization that aims to promote Korean culture, language, and history with contemporary media as its main avenue to the Loyola Schools community. As the student arm of the Ateneo Korean Studies Program, BlueHan provides opportunities for students to discover more about and express their enthusiasm towards the Korean culture.",
		"Advocacy": "Blue Hanguk Society aims to educate members of the Ateneo community about Korean culture in order to foster appreciation and enthusiasm in learning and being informed about about other cultures in the world alongside our own.",
		"Vision": "Blue Hanguk Society aspires to foster a community instilled with an engaged perception of Korean culture, exploring its rich aspects through a worldview perspective in the Filipino community.",
		"Mission": "Blue Hanguk Society serves as an organization that unites Korean culture enthusiasts from the Ateneo de Manila University while upholding the Filipino identity to healthily open avenues for the celebration of Korean culture.",
		"Application Process": "1) Students are asked to register for the organization during recruitment week.\n2) Once they have registered themselves, they will have an entry interview with one of the officers of our Executive-Central Board in order to get to know applicants and understand their reasons as to why they wish to join the organization.",
		"Featured": "1) FOREVER YOUNG\nForever Young is the organization's project for celebrating the Korean style of beauty and wellness. It is a talk series where experts from the different fields of fashion, beauty, and wellness come to give advice and tips to members of the Ateneo community who are interested in learning more about the latest health and beauty trends in Korea.\n\n2) SEOLLAL\nBased on the real Korean tradition, Seollal is the annual project of the organization that aims to celebrate the Lunar New Year in Korea. Traditional practices and games are introduced to the Ateneo community to further deepen their knowledge about the tradition and, in turn, celebrate it with others.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1K9UwposO-QCIv6LmFeb18WHYUEmrf5o4;https://drive.google.com/u/2/open?usp=forms_web&id=16OBA5Yu_YyI8Inq2-IGjsMNWbEYQCjox",
		"Tagline": "Be anything, be BlueHan!",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1HJxd8eEsaGtlIC8vTQ5NY1Ktqc5ERd-C",
		"Benefits": "As the Philippines continues to embrace more of Korean culture through different media, learning more about Korean culture becomes important because it allows members of the Ateneo community to gain a better grasp of how we become influenced by cultures from all around the world. BlueHan, then, provides the Ateneo community with projects that showcase the different forms of the Korean Wave. Moreover, members are given the opportunity to meet other people who have the same interests, creating bonds and strengthening a community that shows the same appreciation and passion for Korean culture.",
		"Flagships": "FOREVER YOUNG\nForever Young is the organization's project for celebrating the Korean style of beauty and wellness. It is a talk series where experts from the different fields of fashion, beauty, and wellness come to give advice and tips to members of the Ateneo community who are interested in learning more about the latest health and beauty trends in Korea.",
		"Departments": "PROJECT MANAGEMENT \nThe Project Management Department is in charge of planning and executing all of Blue Hanguk Society's yearly projects and events. This includes the ideation, goal-setting, strategic planning, and liaising between different departments' involvements in said projects.\n\nHUMAN RESOURCES\nThe Human Resources Department fosters a comfortable environment for Korean culture enthusiasts by working closely with members of Blue Hanguk Society. The department is responsible for keeping the members engaged in the activities of the organization, as well as allowing them to express their appreciation through various initiatives throughout the year.\n\nEXTERNALS\nThe Externals Department is the overall face of Blue Hanguk Society. The primary tasks of the department include contacting, communication, and negotiating with outside entities, as well as dealing with all auxiliary processes related to the latter. The department aims to help promote the organization through the creation of strategic and mutually-beneficial partnerships with institutions both inside and outside the Ateneo.\n\nRESEARCH AND DEVELOPMENT\nThe Research & Development Department aims to substantiate the organizational activities of Blue Hanguk Society through proactive pursuits of knowledge regarding sociocultural facets of Korea as well as providing necessary background information for events handled by the organization.\n\nOFFICE OF THE SECRETARY GENERAL\nThe Office of the Secretary-General (OSG) is responsible for the documentation and organization of the internal systems within Blue Hanguk Society. The office is in charge of taking minutes during official meetings, noting the attendance of officers and members, as well as filling and organizing official documents of the organization. The OSG also acts as a bridge between departments, communicating with them regarding the deliverables and tasks needed to accomplish for a project or event.\n\nFINANCE\nThe Finance Department is responsible for acquiring and managing the funds for the organization, as well as planning the expenditure of these funds. The department aims towards efficient management and cash flow control needed to support the projects of Blue Hanguk Society.\n\nCREATIVES\nThe Creatives Department is responsible for creating the promotional materials needed by the organization. It also works together with the other departments to ensure that all deadlines are followed. The department aims to promote Blue Hanguk Society through promotional materials which carry creative and effective designs that reflect Korean culture.\n",
		"Facebook": "https://www.facebook.com/BlueHangukSociety",
		"SocMed Handles": "Twitter: https://twitter.com/BlueHanSociety | Instagram: https://www.instagram.com/bluehanguksociety/"
	},
	{
		"Representative": "Angelica Casuela",
		"Organization": "OpenSource",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1aLxMl9SsjFut8BYv_jLk3iRaK9sy-9aV",
		"Description": "OpenSource strives to provide students a community that is inclusive to anyone who is willing and interested to learn about tech; a community whose members come from diverse perspectives, fostering innovation and creative thinking; and a community that learns about tech and creates it for the purpose of enabling themselves and others to do more.",
		"Advocacy": "We believe that tech should be enabling, interdisciplinary, and inclusive.",
		"Vision": "To be the foremost community in Ateneo that champions and advocates for technology as enabling, interdisciplinary, and inclusive.",
		"Mission": "To provide avenues for students to broaden, advocate and apply their knowledge and appreciation of innovative, relevant, and emerging technology for themselves and their community.",
		"Application Process": "1. The student must have filled up the application form provided.\n2. The student must have completed an interview he/she scheduled with a member of the Executive Board.\n3. The student must have attended the General Assembly or a make-up individual consultation with a Executive Board member.",
		"Featured": "Workshops - OpenSource holds workshops from practical tech skills to creative applications of tech to give members the skillset to build something for themselves and the community.\n\nThink Tank  - An ideation competition where in students are given the time and resources to be able to come up with technology-based solutions to modern day challenges. ",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1-x5xyZNIavMlVtasZ0gyqdRiP3WBdlfW;https://drive.google.com/u/2/open?usp=forms_web&id=1T6ixONrLeejK9gP6UVhM6XGez4SfnjZb;https://drive.google.com/u/2/open?usp=forms_web&id=1vZ8MCCAmsijt8lboLb8xlXPMk-gHYLBi",
		"Tagline": "Explore Tech with Us",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1NF1BZLOrhYcvmSFxj_95XQVDqgMuEDBv",
		"Benefits": "Tech doesn't have to be all technical but can be practical and fun 😎 Join us as we build a community of students from any background wherein we can advocate for technology that is enabling, interdisciplinary, and inclusive!",
		"Flagships": "TechX - Our flagship project, TECHx is a talk and mixer event that discuss how technology is integrated in different areas of society and in our daily lives. We try to foresee the future technology intends to build.",
		"Departments": "Tech and Research - The department is responsible in producing relevant, accurate and interesting topics about tech and spearheads conversation and discussion about tech. \nVisual Communication - The department is responsible in creating visual event collaterals and documenting events. \nExternal Relations - The department is responsible for contacting sponsorships and partnerships and serves as a representative of the organization to external parties.\nCommunity Engagement - The department responsible in social media engagement and management. They are also responsible for member engagement and development. \nContent Creation - The department responsible for the production of creative content such as, but not limited, podcasts and videos.",
		"Facebook": "https://www.facebook.com/OpenSourceADMU/",
		"SocMed Handles": "Twitter: @OpenSourceADMU"
	},
	{
		"Representative": "Arch Gabriel Tesorero",
		"Organization": "Project KaBUHAYan",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1Cny2W-0tKr7w-88J_O1XdyWNe1HXCGc1",
		"Description": "Project KaBUHAYan aims to creates socio-economic impact on MSMEs in the Philippines.",
		"Advocacy": "Empowerment of Micro, Small, and Medium Enterprises (MSMEs)",
		"Vision": "Project KaBUHAYan strives to become the premier student-led, nationwide organization that creates social and economic impact to MSMEs in the Philippines. ",
		"Mission": "Project KaBUHAYan aims to encourage and provide programs that may enhance the competencies of aspiring and existing MSME entrepreneurs on entrepreneurial development and financial literacy through KaBUHAYan sessions and various student-led initiatives, consequently providing opportunities for the growth of its student advocates. ",
		"Application Process": "Interviews and General Assembly",
		"Featured": "TAGuyod Initiative\nA two-part initiative that aims to maximize social media’s reach, this initiative involves sharing a series of publication materials to inform and educate a wide audience while simultaneously promoting MSMEs and their products.\n\nKaBUHAYan Sessions\nThe KaBUHAYan Sessions is the flagship project of PK that aims to empower partner communities in financial literacy and entrepreneurial development through modules and workshops. This initiative is usually done physically but the department is looking into online sessions.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1n3h1CsXUcvA45jN76bGeViEn7Qs7ObyV;https://drive.google.com/u/2/open?usp=forms_web&id=1ebG1KWSU71Dx0y01_EqBUwC_ZbrDX-pG",
		"Tagline": null,
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1O_W_PSPOHk66IFhkB7CLMaloBHpHwbWA",
		"Benefits": "Adapting into the new normal, MSMEs have leaped into the unfamiliar with plans of restarting and keeping their businesses thriving. Join us in the spirit of bayanihan as we stand with filipino entrepreneurs in confronting these challenging times.",
		"Flagships": "Online Market\nThe Online Market aims to establish a mini-mart wherein products of the partner communities will be showcased not just every weekend but, every day at online platform. It also aims to increase the  profits of their businesses in light of the situation of COVID-19.\n\nBusiness Modules for the Youth\nThis project initiative aims to educate our Filipino youth on the benefits of starting a business, including its social and economic impacts to society, as well as to inspire the youth to not be disheartened or scared to start an entrepreneurial mindset and pursue it.",
		"Departments": "Secretary-General\nTasked to keep all important data and information related to Project KaBUHAYan \n\nCommunications Department\nIn charge of promoting the organization and its activities, events, and projects and ensure the consistency/cohesiveness of branding\n\nCommunity Relations Department\nResponsible for finding and establishing partnerships with communities\n\nPublic Relations and Finance Department\nIn charge of the proper allocation, management, and tracking of finances of the organization\n\nMember Relations Department\nTasked to promote members’ growth and development in the organization, especially in its advocacy",
		"Facebook": "https://www.facebook.com/ProjectKaBUHAYan",
		"SocMed Handles": "https://www.instagram.com/projectkabuhayan/; https://www.linkedin.com/company/projectkabuhayan/"
	},
	{
		"Representative": "Manolo Soliven",
		"Organization": "Mokoa Animation Studio",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=10SeH-6aHXDIoAhEfP0RXqBaMDSHOEeBw;https://drive.google.com/u/2/open?usp=forms_web&id=1MfXqeYkSJV_WQodrd4vFetEaLXIiAcIw",
		"Description": "Mokoa is an organization that centers around the limitlessly imaginative medium that is animation. We believe that animation is an art form that emotionally resonates with anyone and everyone, regardless of interests, age, or cultural background.",
		"Advocacy": "Mokoa advocates for the broad appreciation of animation as an art form, as well as the formation of a unique identity for Philippine animation",
		"Vision": "Mokoa, as an organization, aspires to create a community for artists and animation enthusiasts to give ample representation to the art of animation. Through the production of animation, Mokoa strives to extend the art and its message to the audience it may reach, instilling a sense of appreciation for the medium and its creators",
		"Mission": "To bring artists, storytellers, and other animation enthusiasts together to celebrate animation as a medium of expression, form a community that helps develop its members’ skills through collaborations and projects, and contribute to the formation of a unique identity for Philippine animation by engaging in the process of animation production",
		"Application Process": "There will be no standard application to join Mokoa, however, each member is expected to be part of a committee. Each committee will have varying applications depending on the task they perform (i.e. screenwriting, animation, human resources, creatives, etc..). Please expect to submit at least a portfolio for the more art-centered committees.",
		"Featured": "Into the Drawing Board\nA series of online workshops and lectures hosted by professional artists and animators. These workshops will tackle major steps in the animation process, starting from pre-production topics such as storyboarding, to drawing frame-by-frame animations, and ending in post-production topics such as video editing. Aside from these major workshops, lectures may also be provided for specializations such as voice-acting. \n\nAnimation Celebration\nA monthly event commemorating selected animated films and shorts based on an overarching theme. Throughout the month, online games and facts will be posted relating to these featured films. Depending on the film, screenings may also be held through our online hub.\n\nWeekly Show-off Jump!\nAn optional activity that prompts members weekly to write, illustrate, animate, or voice act under a certain theme. Submissions for the week will be displayed on our online hub and social media accounts with the approval of our members.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1dv-wVdZqaNzLPk2whrNnmrv1CQbObq7g;https://drive.google.com/u/2/open?usp=forms_web&id=1oozO0bDdj1q7O7lU1uib_N65thqAPHlR;https://drive.google.com/u/2/open?usp=forms_web&id=1RBc0Lv0SJ2nf1kU3ehHDXuVW_XTZPlIg",
		"Tagline": "Moving together, one frame at a time",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1Utine_ADOFrq89ZiG5-Vxv7uorXnDWpe",
		"Benefits": "Mokoa Animation Studio as an organization was created not just for artists, but for those with a deep passion for animation. We strive not only to create animations and films, but to also offer our organization as a platform for learning the animation process. Members of Mokoa not only find a platform to hone their skills, but also a close-knit community of animation enthusiasts in Ateneo.",
		"Flagships": "Mokoa Presents\nMokoa's annual year-end project will be the release of a major short film, produced entirely by our members over the course of the school year. Through Mokoa Presents, members will experience the process of animation firsthand and the fulfillment of working as a team on an animated film.",
		"Departments": "[Internals]\n\t{Human Resources}: Handles member interaction and engagement\n\n\t{Secretariat}: In charge of tracking the other committees' progress, as well as gathering feedback from members on the organization's performance\n\n[Externals]\n\t{Marketing and Promotions}: Handles the organization's social media presence\n\n\t{Communications}\n\t\tDocumentations: Documents organization events, projects, and other activities through taking of photos and writing accounts\n\n\t\tCreatives: Creates promotional materials for the organization's activities\n\n[Production]\n\t{Pre-Production}\n\t\tProduction Research: Focuses on the exploration of a concept through concept art and worldbuilding\n\n\n\t\tScriptwriting: Writing original scripts for animated films. Includes but is not limited to: dialogue, action scripts, and setting composition\n\n\t\tStoryboarding: Lays out and composes the original script visually\n\n\n\t{Studio}\n\t\tAnimation: Produces the visuals for all production projects. It involves sketching, in-betweening, lining, and coloring\n\n\t\tVoice Acting: Lends a variety of voice talents for organization projects\n\n\t\tSounds: Records and mixes original soundtracks, foley, and mixing\n\n\n\t{Post-Production}: Processes all production work for publication",
		"Facebook": "https://www.facebook.com/mokoa.animation/?eid=ARAug9E4PQcxIWu4XGgm7yLUg0SAfYIPLRPrIGvLLq75s4V1MwJ2VdXVoR2f0ig5niVU7Rmo7wzdcfoO",
		"SocMed Handles": "Twitter: @mokoa_animation Instagram: @mokoa.animation YouTube: Mokoa Animation https://www.youtube.com/channel/UCF7M3BU7GWynuoZPky7QkJQ Website: https://mokoa.org/ "
	},
	{
		"Representative": "Shelby Parlade",
		"Organization": "WriterSkill ",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1s1Mhib7oJRsr5FFF_daB3TSn89Iwahs6",
		"Description": "WriterSkill provides a community for writers pursuing the betterment of their craft.\n",
		"Advocacy": null,
		"Vision": "WriterSkill envisions a community of writers that aims to share its members' passion for writing and literature not only within itself but also with the outside world. The organization aspires to raise interest for writing and literature in general, with the greater aims of social involvement and responsible advocacy through writing, in support of the country and geared towards progressive nation building.",
		"Mission": "WriterSkill, driven by its desire to realize its members' writing potential in the four genres of Fiction, Non-Fiction, Poetry, and Drama, as well as in various other literary forms, strives to aid each member in recognizing and developing their capacity for excellence in writing and critiquing through the implementation of various relevant programs, projects, and events.",
		"Application Process": "1. Interested members will register during RecWeek. This school year, the registration fee of Php 100 will be waived. \n2. They must then accept the Facebook Friend Request from WriterSkill PenPal, our org mascot, and the Facebook group invite to WriterSkill 2020-2021. \n3. In the Facebook group, a video of the General Assembly will be uploaded and after watching the GA, members will be asked to answer a Google Form which will serve as their interview.\n4. Those interested in joining departments must express their interest in the Google Form and attend a follow-up interview with their respective Departmental Vice-President.\n5. That’s it! You are now part of the WriterSkill community! \n",
		"Featured": "Workshops - At the heart of WriterSkill experience is the Workshop, an event in which members develop their craft through the advice and critique of fellow members. Usually held four times a year, members have the opportunity to submit their works. Members read each other’s piece prior to the workshop proper, upon which they share their thoughts and comments through an open discussion guided by one of the org’s Workshop Facilitators. Afterwards, members may revise their pieces for a chance to have the final version published in our annual chapbook. \n\nGenre Talks - To cater to the varying literary tastes of writers, WriterSkill hosts symposiums called Genre Talks for different kinds of literary work. Here, a professional is invited to speak about their genre specialty, sharing their experiences and techniques when tackling the craft. \n\nWriterSpeac - WriterSpeac is the organization’s annual open mic event wherein members may perform dramatic readings of literary works or their own writing, musical acts, and even stand-up comedy. The event encourages confidence and creativity in one’s own craft by sharing it with friends and peers in the org who’ve shared their journey.\n",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1BKU47aYfVftosYMZcf-ggvfgk5xCC8cS;https://drive.google.com/u/2/open?usp=forms_web&id=1l7_KymkYeN83ENfgb4o2uWT9a7v_YXQN;https://drive.google.com/u/2/open?usp=forms_web&id=1JTNi-l5GFnxWcFIRFKRltpM9aJFtGduq",
		"Tagline": "Excellence in Progress",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=111FblxJwdJfhm2Po_fvuehC6xxbwFEUa",
		"Benefits": "- WriterSkill has a place for anyone in its community of creative minds and literary buffs of all sorts, all dedicated to sharing their ideas and works.\n- WriterSkill guarantees opportunities for you to reach and even exceed your potential as a writer, turning anyone into the best authors that they can be.\n- WriterSkill gives its members access to invaluable resources, such as critical texts, excerpts of literature, and resource speakers. \n",
		"Flagships": "Workshops - At the heart of WriterSkill experience is the Workshop, an event in which members develop their craft through the advice and critique of fellow members. Usually held four times a year, members have the opportunity to submit their works. Members read each other’s piece prior to the workshop proper, upon which they share their thoughts and comments through an open discussion guided by one of the org’s Workshop Facilitators. Afterwards, members may revise their pieces for a chance to have the final version published in our annual chapbook. \n\nGenre Talks - To cater to the varying literary tastes of writers, WriterSkill hosts symposiums called Genre Talks for different kinds of literary work. Here, a professional is invited to speak about their genre specialty, sharing their experiences and techniques when tackling the craft. \n\nWriterSpeac - WriterSpeac is the organization’s annual open mic event wherein members may perform dramatic readings of literary works or their own writing, musical acts, and even stand-up comedy. The event encourages confidence and creativity in one’s own craft by sharing it with friends and peers in the org who’ve shared their journey.\n",
		"Departments": "Events - The Department of Events is tasked with handling all logistical procedures necessary for the creation of projects on and off campus.\n\nHuman Resources - The Department of Human Resources facilitates all affairs pertaining to member development and provides avenues for resolution in cases of conflict. \n\nVisuals & Documentations - The Department of Visuals and Documentations serves as the custodian of the WriterSkill brand and provides design and layout services for the organization’s promotions and publications. \n\nWorkshops - The Department of Workshops organizes avenues designed to encourage WriterSkill members to produce, submit, and critique literary outputs.\n",
		"Facebook": "https://www.facebook.com/writerskill/",
		"SocMed Handles": "https://twitter.com/ADMUWriterSkill https://twitter.com/WSPenpal"
	},
	{
		"Representative": "Joaquin Santana",
		"Organization": "Blue Indie Komiks",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1WuwEu1RphR7PiY2IusQ-mKEQPD36tv0R",
		"Description": "Blue Independent Komiks, or BLINK, is an organization that serves as a space for creators and enthusiasts of Komiks and the like to further develop and explore Komiks.",
		"Advocacy": "By connecting and uniting the many people who know of the existence, immense creativity, and life contained in Komiks, this organization will, through its members, encourage potential audiences (primarily within the Loyola Schools) to appreciate and partake in Komiks. It is hoped that, through this encouragement, more people can learn to appreciate and consume Komiks.",
		"Vision": "Blue Indie Komiks envisions itself as a community of komik creators and appreciators, that then acts as a positive forcein the greater komiks community. We strive to involve and emphasize our members in the creation of engaging and meaningful content – content that then serves to expand the perspectives of those within and outside our community. Creating Komiks BLINK envisions the creation of its Komiks as a cooperative act that takes place in an engaging, active environment. This environment will encourage members to work together to create Komiks that promote and display Filipino artistry and Philippine Culture. Through this cooperative act, the members will develop new skills and mindsets, which will then aid them in applying their creativity to any and all tasks they might face. Appreciating Komiks Through the active creation, consumption, and sharing of Komiks and Komiks-related media, it is envisioned that the members of BLINK will be able to deepen their understanding and appreciation of Komiks. This deepened understanding and appreciation will propel the members of BLINK to promote Komiks to others outside of the organization, thus allowing more people to appreciate and consume Komiks.",
		"Mission": "Blue Indie Komiks achieves its vision by providing projects and opportunities to its members to explore the different aspects of komik creation. Through these varied projects, BLINK members attain the skills necessary to produce komiks that have the capacity to speak beyond the Ateneo community.",
		"Application Process": "In order to be recognized as a member of Blue Independent Komiks, one must first apply to join the organization. This can be done by registering to join the organization, whether it be through the LIONS recweek or through the online registration form. After doing so, the applicant must pay an applicant fee (which will be waived this school year due to complications arising from COVID-19), and schedule an official BLINK interview. For this school year, one will be considered a member, and no longer an applicant, once they have they have had their official BLINK interview.\n",
		"Featured": "Participation in Komiket and Komikon: Every school year, BLINK tables at four major local conventions: October Komiket, November Komikon, February Komiket, and Summer Komikon. At these conventions, BLINK sells the original komiks and merchandise we produce, such as our semestral zines and the BLINK Originals komiks. Aside from our own merchandise, we also open the table to our members who might want to sell their own merchandise alongside us -- whether they be stickers, prints, charms, or even original komiks!\n\nSemestral Zines: Every semester, BLINK creates a zine consisting of multiple short komiks and artworks revolving around a central theme. These short komiks and artworks are made over the course of several weeks by our members themselves, with our deliberation and guidance. When the zine is completed, we hold a launch to celebrate the creations of our members and to share their works with the Ateneo community!\n\nBLINK Originals: Every school year, BLINK gives our members the opportunity to work alongside us in creating their own original komik. At the end of the first semester, we accept pitches from our members, which serve as the starting point for their original komiks. For the following three months, we guide our members through the process of turning their komik from idea to reality. After the komiks have been made, we choose one to publish on our Facebook page, as well as in print!\n\nEGG: Every month or so, BLINK members gather together to share comics with each other, and draw together. In these small gatherings, we provide our members opportunities to find new komiks  to read, and make new friends within the organization.\n\nBimonthly Komiks: Every two weeks, we post a member-made komik on our Facebook page. These komiks follow the lives of two characters we created, Chili and Laksa, and are an opportunity for our members to get their feet wet with komik creation.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=17K2U0VP84Zkd-uAbOpC2SoQI8CEkpmfT;https://drive.google.com/u/2/open?usp=forms_web&id=1Jk0kOXKU1ejFIY89TdEVtc5oxKqbJQBY;https://drive.google.com/u/2/open?usp=forms_web&id=1zBSi1MKaIHlTaqJocyYlxcX4POJQFYIh;https://drive.google.com/u/2/open?usp=forms_web&id=1xASBwY3X-Hc4WOeXqnM8CsaYbA8HIeFc;https://drive.google.com/u/2/open?usp=forms_web&id=1NoeFFaanPun3jljPn_jo0o45fsTl18IS",
		"Tagline": "Linking People Through Komiks",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1rZXilYJTW2UvsSjFqkgq_Apxw3RR919G",
		"Benefits": "✔ You'll receive our support and guidance in your creative endeavors\n✔ You'll get to meet and interact with other people who share your love for komiks and creating art\n✔ You'll be exposed to the local komiks scene through local conventions like Komiket and Komikon",
		"Flagships": "Participation in Komiket and Komikon\nEvery school year, BLINK tables at four major local conventions: October Komiket, November Komikon, February Komiket, and Summer Komikon. At these conventions, BLINK sells the original komiks and merchandise we produce, such as our semestral zines and the BLINK Originals komiks. Aside from our own merchandise, we also open the table to our members who might want to sell their own merchandise alongside us -- whether they be stickers, prints, charms, or even original komiks!\n\nSemestral Zines\nEvery semester, BLINK creates a zine consisting of multiple short komiks and artworks revolving around a central theme. These short komiks and artworks are made over the course of several weeks by our members themselves, with our deliberation and guidance. When the zine is completed, we hold a launch to celebrate the creations of our members and to share their works with the Ateneo community!\n\nBLINK Originals\nEvery school year, BLINK gives our members the opportunity to work alongside us in creating their own original komik. At the end of the first semester, we accept pitches from our members, which serve as the starting point for their original komiks. For the following three months, we guide our members through the process of turning their komik from idea to reality. After the komiks have been made, we choose one to publish on our Facebook page, as well as in print!",
		"Departments": "Editing & Deliberations\nThe Editing & Deliberations Department is in charge of maintaining the quality of output created by BLINK members. This is achieved through constructive criticism and workshopping member output. Members of this department supply the constructive criticism and workshopping, which then serves to elevate member output to levels above and beyond BLINK’s standards.\n\nEvents & Projects\nThe Events & Projects Department is in charge of planning the events of BLINK. Members of this department handle the planning and implementation of the events BLINK holds, which entails answering to all the logistical needs BLINK events might have. Additionally, they supervise the creation of member-initiated komiks, by connecting members to the necessary departments.\n\nPromotions & Publications\nThe Promotions & Publication Department is in charge of creating the promotional material of BLINK. Members of this department create publication materials which allow the organization to inform others of the organization’s activities. Additionally, the members of this department are in charge of creating and maintaining the organization’s branding within and outside its community.\n\nRecruitment & Internals\nThe Recruitment & Internals Department is in charge of fostering and protecting the sense of community within the organization. Members of this department create initiatives that allow the organization to engage its members in active discussion. Additionally, members of this department respond to and handle any and all instances of member misconduct.\n",
		"Facebook": "https://www.facebook.com/blueindiekomiks",
		"SocMed Handles": "https://twitter.com/BLINKofficialph"
	},
	{
		"Representative": "Jaime Miguel B. Gozar",
		"Organization": "THINC",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1FgT2dRYUG6Stocjk0Lwv3It_x9VFYlU2",
		"Description": "THINC is the premier Tabletop Hobby Organization of the Ateneo. We provide a space for all Ateneo students to relax, try out various tabletop games, and engage with others who have similar interests; as well as provide a venue for students to explore new hobbies through our events.",
		"Advocacy": "Community Development",
		"Vision": "To foster a leading community for interested individuals to freely discover, share, and enjoy various tabletop hobbies under the welcoming camaraderie of both old and new tabletop enthusiasts. We aim to explore further the positives that tabletop interests can explore as a medium such as social utility, psychological benefits, cultural relevance and trends, fine arts, and national identity.",
		"Mission": "To provide a space for a community to explore, discover, and appreciate various tabletop hobbies. We strive to create a healthy and safe social atmosphere where people can freely share hobbies and interests with respect and camaraderie towards each other. We push for the exploration and sharing of tabletop interests as a medium for personal growth, analytic thinking, stress relief, and forging healthy relationships.",
		"Application Process": "Simply fill out our registration form and provide payment. If you wish to sign up for a deputy position to help the org grow, check the appropriate boxes on the registration form and you will be contacted by us some time after registration.",
		"Featured": "Weekly Hobby Sessions - Our Tabletop Weekly is a chill weekly gathering where people are free to drop by, try out our board games, and even bring their own board games and card games. Our TRPG Branch also provides weekly Dungeons & Dragons campaigns and even other Tabletop RPGs.\n\nTalks & Workshops - We provide talks and workshops on various tabletop topics such as introductions to new games for beginners and tips on being a Dungeon Master for Dungeons & Dragons.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1kjzERS6xe4P19rW-5idRRRzMw1hL8iQ7;https://drive.google.com/u/2/open?usp=forms_web&id=1K_Xa0GifE2JyBdI5rwRC49cr8Jx2YXCX",
		"Tagline": "Roll with us!",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1OFQrp02UXXFLSdZBiwNwBvj7yKGFzbvF",
		"Benefits": " THINC is a place to relax and meet new friends. Classes, schoolwork, and even other org engagements can take a toll on a student. During THINC events and weekly sessions, students are given a space to unwind, relax, and just have fun. We care about students’ mental health. THINC has routinely participated in the Guidance Office’s Wellness Week/Mental Health Weeks, providing our board games, card games, and our Dungeon Masters for a safe space to express oneself and take care of oneself.\n\nIt's also a place to try new things. Thinking of getting into a hobby, but don’t know where to start? THINC’s officers are always willing to introduce new members to our hobbies and interests! Sometimes the learning threshold may be rough, but with THINCs various interest circles and helpful members, it might be easier than you think!",
		"Flagships": "Tabletop Weekly - A chill weekly gathering where people can drop by at any time, play board games provided by us, and bring their own board games and card games for other people to try out.\n\nThe Indies - A members only event: our TRPG branch hosts weekly campaigns for tabletop role-playing games like Dungeons & Dragons.\n\nWorkshops & Talks - Insightful talks and workshops on various tabletop topics such as: tips for being a Dungeon Master for Dungeons & Dragons, introductions to new tabletop games for beginners, and even miniature painting. Workshops and talks may be open to all Ateneans or member exclusive.",
		"Departments": "Creatives - Our Creatives department provides us with art assets and promotional material for our events.\n\nPublic Relations - Our PR department manages our social media, handles online engagements with the community, and keeps contact with other organizations for events and collaborations.\n\nLogistics - Our logistics department handles the venue reservations and paperwork for our events and activities.\n\nBoard Games Branch - Our Board Games Branch is responsible for conceptualising and managing all events and activities related to board games.\n\nCard Games Branch - Our Card Games Branch is responsible for conceptualising and managing all events and activities related to Trading Card Games like Magic: The Gathering.\n\nMiniatures Branch - Our Miniatures Branch is responsible for conceptualising and managing all events and activities related to Gunpla building and Miniature Wargaming like Warhammer 40k. \n\nTRPG Branch - Our TRPG Branch is responsible for conceptualising and managing all events and activities related to Tabletop Role-Playing Games like Dungeons & Dragons.",
		"Facebook": "https://www.facebook.com/ThincHobbiesThincInterests/",
		"SocMed Handles": null
	},
	{
		"Representative": "Brian Gan",
		"Organization": "Junior Fellowship for Financial Literacy",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1hIWjt71WtFQGb7qrfGerd29xhwi4-Tvn",
		"Description": "JFEL is an avenue for the students of Ateneo de Manila University to pursue their interest in various fields within the finance industry.",
		"Advocacy": "Financial Literacy",
		"Vision": "To create a nation of financially proficient citizens who are able to apply their knowledge to their everyday situations. ",
		"Mission": "To equip both its members, as well as people outside the organization, with sound Financial skills to utilize in everyday Financial situations through its various talks, training seminars, an programs.",
		"Application Process": "1. Like and Follow the Facebook and Instagram Page (Optional)\n2.Fill Up the Form\n3.Send Money\n4.Send Proof of Payment to J Fellow\n5.Add J Fellow\n6.J Fellow will add you to the group",
		"Featured": "JFeL Summit -JFeL Summit is a one-day seminar which serves as a platform for students and professionals alike to gather and discuss various topics of finance in different fields of work. JFeL Summit  serves to culminate all the learnings and skills that members have garnered throughout the school year. In this event, students can expect to interact with professionals who have hands-on experiences and dealings in the financial world.\n\nGears-JFeL GEARS is the organization’s premier stock trading competition that aims to find the best student trader all across different universities in the Philippines. JFeL GEARS has been running for more than 3 years and it has been able to award more than Php 30,000 worth of prizes to its winners. Now in its fourth year, we aim to bring JFeL GEARS to a greater reach and motivate more students to try the stock market.\n\nJ Flip - JFeL’s exclusive investing mentorship program that focuses on the basics and foundations of investing. Both mentors and mentees will be provided with modules to accompany their teaching/learning. Its goal is to produce financially literate individuals who are able to spot and take advantage of opportunities in the financial markets.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=106QCMMQGV29jk_RyiugoOXsmOiJnAISy;https://drive.google.com/u/2/open?usp=forms_web&id=1k5s1eJ70Bw9hC5Z6eUrqZ1fE_HQk3OaT;https://drive.google.com/u/2/open?usp=forms_web&id=1yI225QArihECpsf2uHszy9OJGUTWMjS6",
		"Tagline": "Elevating Financial Literacy",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1b9nZmEt12c2OIpjDcTIm3FHd9LcS1uwb",
		"Benefits": "Community - JFe L is a community of students who want to understand the world around them through finance. This organization is for students who want to be surrounded by like minded people with an interest in financial activities, especially the stock market.\n\nOpportunities - Graduated members of JFeL are presently employed in various sectors of the financial industry such as Investment Banking, Brokerage firms, and Financial Research. JFeL provides its members opportunities to meet its alumni in order to learn about professions in the finance industry.\n\nSocial Responsibility- JFeL aims to elevate financial literacy not just to individuals inside Ateneo but also outside the institution. The goal of our corporate social responsibility initiatives are to empower communities and create a social impact through finance.\n\nJoining Junior Fellowship for Financial Literacy will give you the trading edge.\n",
		"Flagships": "JFellow’s Carnival (First Semester)\n    JFellow’s Carnival is a new initiative that started as a small event during last year’s SOM Business Month. On its first year as an independent project, JFellow’s Carnival is a one-week event which serves as an avenue for members to hone their financial skills through fun and exciting activities. It also aims to promote that learning about finance doesn’t have to be all about trends and numbers. It can be done through games, too.\n\nJFeL GEARS (Second Semester)\n    JFeL GEARS is the organization’s premier stock trading competition that aims to find the best student trader all across different universities in the Philippines. JFeL GEARS has been running for more than 3 years and it has been able to award more than Php 30,000 worth of prizes to its winners. Now in its fourth year, we aim to bring JFeL GEARS to a greater reach and motivate more students to try the stock market.\n\nFinancial World Simulation (Second Semester)\n    Financial World Simulation is a 2-day case study which aims to find the best student investor in the Ateneo. This event challenges participants to test their financial knowledge and acumen in a simulated financial environment. Financial World Simulation aims to promote different investment options and financial instruments to students while giving them more exposure to realistic financial happenings in the world. \n\nJFeL Summit\n    JFeL Summit is a one-day seminar which serves as a platform for students and professionals alike to gather and discuss various topics of finance in different fields of work. JFeL Summit  serves to culminate all the learnings and skills that members have garnered throughout the school year. In this event, students can expect to interact with professionals who have hands-on experiences and dealings in the financial world.",
		"Departments": "Asset Management - This department will be in charge of the most important asset of the organization, the members. It ensures that everyone is having a good organization experience and makes sure that growth and relationships are fostered among members.\n\nBrand Management -  This department is the face of JFeL. It is in charge of creating all publication materials, spiels,  and basically anything that can be juiced out of creativity! It also handles our social media pages and create marketing strategies for the organisation. Its goal is to engage current members and entice non-members to join JFeL and numerous initiatives through publications that are visually appealing and easy to consume.\n\nCorporate Investments - This department handles all the external investments coming from corporations and professional organizations. It creates partnerships, makes connections, and contacts other organizations and companies. It also maintains and cultivates these relationships which in turn expand the organization and the department's networks.\n\nThe Financial Literacy -  This department embodies the core mission of JFeL: elevating financial literacy. It is in charge of teaching, organizing trading competitions, and hosting talks to be able to provide the best learning experience in the world of investing. Through its projects, members will have the opportunity to be mentored by skilled and experienced investors and traders to guide them through their journey to becoming financially literate. It believes that anybody is capable of learning about the financial markets.\n\nFinancial Management - One of the foundation of any organization are healthy finances. The proper allocation, management, and tracking of finances can be one of the deciding factors between the success and failure of a project or the organization as a whole. This department values transparency and accountability above all.\n\nInvestment Research - This department produces content which covers relevant financial topics for JFeL. It also builds the tools that would aid in the endeavors of its members in their quest for financial literacy. Its mission is to deliver substance into the org,  highlighting the reason it was formed.\n\nProject Management - his department handles the execution of flagship projects and corporate social responsibility initiatives of JFeL. The core of its work is to provide members and partners with quality projects that are in line with JFeL's principles of elevating financial literacy and inclusive financial education and opportunities for all.",
		"Facebook": "https://www.facebook.com/jfelonline/",
		"SocMed Handles": "Instagram: https://www.instagram.com/j.fellow_ship/"
	},
	{
		"Representative": "Frances Therese Ong",
		"Organization": "BYTE",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=11048IC4EfW1KM_QeKZa9kjnSURwFnOwK",
		"Description": "BYTE is the home organization of the BS Information Technology Entrepreneurship (ITE) course in the Ateneo de Manila University. We aim to provide various opportunities to our members to develop ITE's 3Hs [Hacker, Hipster, Hustler], while cultivating an inclusive home organization.",
		"Advocacy": "BYTE aims to promote tech entrepreneurship to the youth, in and outside of The Ateneo. We aim to empower students with the necessary skills and knowledge in order to cultivate the next generation of leaders and nation-builders of our country.",
		"Vision": "BYTE envisions itself to be a technological and entrepreneurial network spearheaded by existing and potential catalysts for change.",
		"Mission": "BYTE cultivates young entrepreneurs who create innovative and technological solutions that strive for nation-building.",
		"Application Process": "Any undergraduate student of AdMU can be a member of BYTE simply by signing-up online during RecWeek. In light of the recent pandemic, we have also decided to forego our registration fee this year to encourage more members to join our organization.",
		"Featured": "Startup Summit - Startup Summit is a conference that will hear from numerous successful founders and entrepreneurs from the Philippine startup community to allow pa to learn from their experiences. There will also be startup booths set-up to provide internship, job, and networking opportunities that will introduce them into the rich world of startups.  \n\nNibble Series - Nibble Series is a month-long chain of workshops from industry practitioners that will teach its audience different aspects of launching a startup, from start to finish. The entire event is capped off with an innovation challenge where participants can showcase the skills they've learned through Nibble. \n\nITECH - ITECH is an online platform where BYTE members can access various resources that supplement their learning of ITE's 3Hs — Hacker, Hipster, Hustler. \n\nOnline BYTE Tables - Online BYTE Tables is a recurring online activity that aims to replicate the physical BYTE tables by providing members an avenue to bond through sharing, movies, games, karaoke, and more. \n\nReboot - Reboot is ITE's Freshman Preparatory Course composed of talks and activities aimed at introducing freshmen and new shift-ins to the course and the BYTE family. \n\nFrostBYTE - FrostBYTE is BYTE's Christmas celebration which includes a series of activities such as exchange gifts, letter writing, Christmas movies, Christmas karaoke, and more.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1mG1rZdMiZXatU0PZVBRc_tlvRgOQ5cn0;https://drive.google.com/u/2/open?usp=forms_web&id=1TQJ8XRrPPNot-YEw8SY5sHTOBzmvFSDS;https://drive.google.com/u/2/open?usp=forms_web&id=1bSw6MpRz6kRU8rG_ve_1MJv2A8dWSaiS;https://drive.google.com/u/2/open?usp=forms_web&id=1O1bVX5xOFOJpu1v26DjzgI-VW4YyLoD6;https://drive.google.com/u/2/open?usp=forms_web&id=1u3lnbgX3T7r0Jxzco0iNH05mRfvMCwxM;https://drive.google.com/u/2/open?usp=forms_web&id=1fdUX10nWmwbwkpZmQ15FDcQ_MMbm8TPO",
		"Tagline": "Building Young Tech Entrepreneurs ",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1MWFaNL2I8-XJIX8etBHYYJbSbix4a-6o",
		"Benefits": "If you are interested in tech entrepreneurship, getting involved in the startup scene, and being part of welcoming and supportive community that will help create the next big innovation, you should definitely join BYTE! We offer various opportunities for learning, application, and networking; and various activities such as talks, workshops, summits, competitions, and more! Sign up and join BYTE now!",
		"Flagships": "Nibble Series - Nibble Series aims to arm its participants with the necessary knowledge to overcome the insurmountable task of creating a great startup. The event will take its participants through the steps they have to take - from ideation to launch. Professionals from the industry will be holding workshops to provide direction for its participants as they embark on their own startup journeys. The innovation challenge will grind the participants' ideas, knowledge and grit as they work to be the most creative and groundbreaking team.  Nibble Series is the stepping stone for anyone who would like to venture into the unknown world of startups and create the next big thing.\n\nStartup Summit - Startup Summit aims to be the participants' first foray into the Philippine startup scene. The event will gather great minds and incredible talents from the local startup community into one place to exchange, cultivate and share ideas between each other and the participants. Individuals from the scene will share their valuable experience and wisdom through talks whilst startup booths will be providing internship and job opportunities. Startup Summit will not only introduce startup ecosystem but also pull participants into its magnificent world.",
		"Departments": "Office of the President - The Office of the President is in charge of overseeing the Executive Board and Central Board, projects, and the systems and processes of the organization.\n\nInformation Management - The Department of Information Management is in charge of the information systems and the information dissemination of and within BYTE.\n\nStrategic Communications - The Department of Strategic Communications is in charge of the management of the organization’s visual image in all deliverables and dissemination of information.\n\nFinance - The Department of Finance is in charge of managing the budget and monitoring the cash flows of the entire organization. We are also in charge of planning project budgets, minimizing expenditures, and monitoring cash flows.\n\nInternal Affairs - The Department of Internal Affairs' primary role is to cultivate healthy member relations and foster a home organization that enables inclusive and supportive growth. \n\nExternal Relations - The Department of External Relations spearheads the cultivation of sustainable and prolific relationships in and outside of The Ateneo.",
		"Facebook": "https://www.facebook.com/byteadmu/",
		"SocMed Handles": "Instagram: https://instagram.com/byteadmu  Twitter: https://twitter.com/byteadmu LinkedIn: https://www.linkedin.com/company/byteadmu YouTube: https://www.youtube.com/channel/UCt19waJJAIEtl9o6iU-IwHA"
	},
	{
		"Representative": "Annika Bengzon",
		"Organization": "RC LIFE - Loyola",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1B3MYpgRsw_tDnu3wDCthJBFMy17jSVZo",
		"Description": "RC LIFE - Loyola is a college youth group & spiritual family that aims to bring Christ’s Kingdom closer to people’s hearts.",
		"Advocacy": "Building the Church through inspiring others to have a deep encounter with Christ and through active participation in apostolates.",
		"Vision": "The vision of RC LIFE is to give the Church in the Philippines passionate young professionals for Christ and His mission.",
		"Mission": "The mission of RC LIFE is to form the members in a way of life that will enable them to be leader-apostles of the New Evangelization, inspired by faith and encounter.",
		"Application Process": "Interviews after acceptance ",
		"Featured": "Holy Hour: Adoration of the Blessed Sacrament with litany prayers and meditation on the mysteries of the Holy Rosary.\n\nEncounters with Christ: Prayer meetings consisting of reading and reflecting on passages from the Bible, wherein members and visitors will be encouraged to share their reflections and insights. \n\nEvangelization Missions: Members and visitors will be visiting a marginalized community where they will conduct catechism for the children as well as bible sharing through house-to-house visits.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1dEvLfGd0CGy3qF8sZwGPuj5SzB4J1g4G;https://drive.google.com/u/2/open?usp=forms_web&id=1oK04YhVMWVZYgpG8PWFT8_cYnB3j-1f-;https://drive.google.com/u/2/open?usp=forms_web&id=12HKdvgJjqcNcX4go2tLg79ZoH_UuLizc",
		"Tagline": "Love Inspired by Faith & Encounter",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=10pEv0x-C-DHBMUKchCOlrMUwU8e64FcO",
		"Benefits": null,
		"Flagships": "Holy Hour: Adoration of the Blessed Sacrament with litany prayers and meditation on the mysteries of the Holy Rosary.\n\nEncounters with Christ: Prayer meetings consisting of reading and reflecting on passages from the Bible, wherein members and visitors will be encouraged to share their reflections and insights. \n\nEvangelization Missions: Members and visitors will be visiting a marginalized community where they will conduct catechism for the children as well as bible sharing through house-to-house visits.",
		"Departments": "Members can apply to be \nEncounters Team Leaders (Spirituality & Formation): Heads of the Encounters with Christ teams which happen once a month\n\nApostolate Core Team (Apostolate): Assist in various activities of the Apostolate department such as Evangelization Missions. ",
		"Facebook": "https://www.facebook.com/RCLIFELoyola/",
		"SocMed Handles": "*Launching an Instagram before RecWeek! May we send it to you once we launch it hehe "
	},
	{
		"Representative": "Algeo Olmilla",
		"Organization": "Project LAAN",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1cFz4TYFmzfrdS9xUeVG_0j6rB7a3kV1E;https://drive.google.com/u/2/open?usp=forms_web&id=1dW5n1mohDGKUrrZzOj04Axdl7QvyArSV",
		"Description": "Project LAAN fights to ensure that all Filipinos can exercise their right to health, especially the poor who need it the most. Project LAAN identifies itself with the tagline “Fighting Poverty Through Health,” which means empowering individuals to make informed health decisions to rise above poverty. ",
		"Advocacy": "Poverty is a barrier to life-saving health care and health knowledge, whether it be through lack of income and/or access to materials. Barriers like these are meant to be overcome. We at Project LAAN believe this can be done through our advocacy of public health.    Given the current COVID-19 pandemic, where health is at the center of attention, it is important for individuals to have general knowledge of public health, for communities to be aware and assert their rights on health, and for society to uplift one another in times of need through this knowledge.     As Project LAAN approaches its 10th year as an organization, the journey towards universal health coverage has just begun. Through public health advocacy, health literacy, and patient empowerment, we can achieve a reality where health is for all without any form of burden. This is how we fight poverty for the families we serve by giving our all for health.",
		"Vision": "Project LAAN envisions a society where every Filipino, especially the poor and vulnerable, has adept knowledge on public health and is empowered to make informed and appropriate health decisions.",
		"Mission": "Project LAAN aims to instill and promote public health advocacy, health literacy, and patient empowerment to its partner communities and members.",
		"Application Process": "1. Aspiring applicants are required to submit their Project LAAN application form online. Once completed, they will be notified about their invitation to join the Project LAAN Applicants FB group where they will be required to select a date to attend the Applicants’ General Assembly.\n\n2. All applicants are required to attend the Applicants’ General Assembly. There, they will be given a short introduction of the organization, a public health crash course, an orientation on Project LAAN’s advocacy, and a breakdown of the recruitment process.\n\n 3. After attending the general assembly, applicants will undergo SimuLAAN. Applicants will be asked to complete short tasks that are intended to build rapport with other members of LAAN. It is also when interviews are conducted for aspiring members.\n\n4. Once they complete the SimuLAAN process, applicants will be subject to deliberation to determine whether they are best fit for the organization. Announcement of deliberation results will be posted on the official Project LAAN FB page. Once accepted, they will be welcomed through our Welcoming General Assembly.\n\n5. For retained members, they are required to only fill up the google form in the LAAN Retained Members FB group and attend the Welcoming General Assembly to officially be part of the organization for the academic year. ",
		"Featured": "Public Health Days (PHeD) - Public Health Days (PHeD) will be an online weeklong project filled with webinars, activities, challenges, and more dedicated to Project LAAN’s public health advocacy, curated for members inside and outside of the organization to learn more about public health concepts in a more engaging and hands-on manner.\n\nCommunity Initiatives - Project LAAN aims to help increase the empowerment and capacity of its partner community to make informed and appropriate health decisions through executing modules, research initiatives, and interventions based on the prevalent diseases and other health-related concerns of the community. Activities are also conceptualized based on their context i.e. what would realistically change their perceptions towards better health making behaviors. Project LAAN also responds to non-modular matters such as any problematic circumstances or unaddressed needs of the community. For this, Project LAAN has held several fundraisers for the community's ambulance repair as well as COVID-19 responses to provide food (PusoKitchen) and sanitation kits (Laban SaKIT) to the community members.\n\nLiPHad: Lessons in Public Health Advocacy - LiPHad: Lessons in Public Health Advocacy is a series of campaigns that aims to tackle sectors and issues beyond the traditionally medical perspective of public health. The campaigns' goal is to identify the pressing issues being faced by these sectors and how the UHC Law affects them. The campaign will have three phases based on issues relevant to the Ateneo Loyola Schools community: environment and disaster management, gender and sexuality, and mental health.\n\nOnline Pledge Week  - Online Pledge Week is a week-long fundraising activity in which promotional materials that showcase Barangay Calawis in Antipolo and our initiatives for them will be posted on the Project LAAN Facebook Page, Instagram, and Twitter. This event aims to encourage pledging and donating small amounts of money to fund future initiatives for the benefit of the organization’s  partner community.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1pOGP-LFKy_q9joXiV9eEGWftBFPXDGkD;https://drive.google.com/u/2/open?usp=forms_web&id=1pKs4iFcdO1yeo4fyO7glZESCHj02mgG6;https://drive.google.com/u/2/open?usp=forms_web&id=1md_vVT2WKWeCQbcigRM4wmUyjbQs8L2w;https://drive.google.com/u/2/open?usp=forms_web&id=17cClA-jrwFHqGazSvm1LW9eRVoHMLkKA",
		"Tagline": "Fighting Poverty Through Health",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1NDAaZ16sG2SdFzzbwq6doPaakJ5Nacru",
		"Benefits": "Now, more than ever, is the link between public health and poverty most evident and pressing. \n\nHeading into our 10th year as an organization, our aim is not only to bring awareness to the advocacy, but to build understanding, informed discourse, and responsibility in our members all while providing them avenues to exercise their learnings. \n\nMembers of Project LAAN will be immersed in the public health advocacy and will have the opportunity to learn more about the Philippine health system and health communication through workshops, talks, module development/research, and community initiatives for our partner communities.\n\nAside from this, members can work with our production and design teams, organize campaigns and discourse talks, set up fundraisers, contact appropriate sponsors, do administrative work, and more! Public health calls for people from ALL fields/sectors; there’s a place for everyone in Project LAAN!",
		"Flagships": "Universal Health Coverage (UHC) Summit - The Universal Health Coverage (UHC) Summit is Project LAAN’s annual flagship project. In line with the organization's thrust for public health advocacy, it will be a two-day symposium wherein people from different sectors and walks of life collaborate together for public health discourse and patient empowerment; bringing in various lenses that seek to give a more nuanced discussion on issues concerning the Philippine healthcare system.\n\nIn the lead-up to this event, a series of campaigns will tackle salient public health issues beyond the medical perspective, and shed light on how these and the UHC Law affect all sectors of society. In addition, community and online modules will also expose the participants beforehand to evidence-based material delving both into a general and a deeper view of UHC. Through these pre-event activities, members and non-members of Project LAAN alike are able to have a clearer and more comprehensive understanding of UHC and their place in it.",
		"Departments": "Communication Design (ComDes) - This department is responsible for developing and promoting the brand of the organization. It is in-charge of designing strategic promotional campaigns that will strengthen member recruitment and communicate LAAN’s advocacy as well as photo and video documentation of the organization’s projects and events.\n\nCommunity Development (ComDev) - This department is responsible for handling community-based projects in partnership with organizations within and outside of the Ateneo de Manila University. It is in-charge of executing modules and projects that help spread public health awareness to fulfill the stated goals and vision in the partner communities of LAAN and other partner organizations\n\nFinance (Fin) - This department is responsible for generating resources for LAAN’s general operations. It is in-charge of ensuring the financial viability and stability of the organization and its operations.\n\nHuman Resources (HR) - This department is responsible for fostering strong community relations among members as well as monitoring adherence to member retention. It is in-charge of the formation of the members and volunteers of the organization by equipping them with fundamental skills and requisite knowledge through leadership development, organization-wide training, and specific skills training.\n\nResearch and Discourse (R&D) - This department is responsible for organizing public health advocacy projects, campaigns, talks, and events. It is in-charge of the production, development and evaluation of technical information, research, and corporate communication content in line with the vision, mission, and advocacy of LAAN.\n\nOffice of Secretary-General (SecGen) - This department is responsible for assessing and screening all preliminary forms for all projects done by the organization. It is in-charge of evaluating internal projects and events of the organization.",
		"Facebook": "https://www.facebook.com/projectlaan",
		"SocMed Handles": "Twitter: https://twitter.com/ProjectLAAN ; Instagram: https://www.instagram.com/projectlaan/ ;  Website: https://projectlaan.org/"
	},
	{
		"Representative": "Patricia Gabrielle Ramos",
		"Organization": "User Experience Society",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1QNKJKcEpbbB6ZPjd5ar4LQJMGZzNTa_Z",
		"Description": "UX Society is a student-run organization that advocates and practices human-centered design in solving problems in the community.",
		"Advocacy": null,
		"Vision": "This organization envisions itself as a community of designers, holistically formed to be people for and with others, who are passionate about solving problems in the community through human-centered design.",
		"Mission": "UX Society empowers people through design education, enlightens them to the power of design, and nurtures them to create meaningful products for the community.",
		"Application Process": "1. Filling up of application forms*\n- Full Name\n- Nickname\n- ID Number\n- Email Address\n- Contact Number\n- Year Level\n- Course\n- School\n- Are you a Scholar?\n- Do you want to receive UXSoc Announcements?\n\n2. Payment\n- Details for payment are TBA.\n\n*UXSoc does not require member screening for RecWeek.",
		"Featured": "As UXSoc transitions online, we'd like to take the opportunity to provide you bigger, more unique, and more engaging event experiences!\n\n1) UXSoc RecWeek: Annual Recruitment Week for LIONS organizations.\n2) UXSoc General Assembly: General assembly for all UXSoc members after RecWeek.\n\nFLAGSHIP PROJECTS:\n1) UX&Chill: An online conference wherein User Experience design professionals share about their work and their passion for design and development.\n2) UX University: A case competition to hone members’ problem-solving skills to create human-centered design for the community. \n3) UX Masters: A special event wherein we invite international speakers to give a talk on their career journey from working with small startups to big brands.\n\nVARIOUS INTEREST AND SKILL WORKSHOPS\n1) Design Workshops: Online workshops and/or talks that covers topics such as UX research, design, and branding.\n2) Development Workshops: Online workshops and/or talks that covers topics for front-end and back-end development.\n3) Interest Workshops: Aside from our design and development workshops, once in a while we hold events to cater to various topics and interests such as career advice, project management, financial literacy, etc.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1zsq4zN5nr3BssNwVdd5uRC2UyVMCmnm3;https://drive.google.com/u/2/open?usp=forms_web&id=1Ii2EY032prxhd6idbhSJnXEiqda7UqJ7;https://drive.google.com/u/2/open?usp=forms_web&id=18-PvfHGPggJ_SpBrogyga0t_q5eivK5S;https://drive.google.com/u/2/open?usp=forms_web&id=1lnBEA7M55B9uNxRYyG9ykifRYkDcXdRz;https://drive.google.com/u/2/open?usp=forms_web&id=1UwNOB-IvKCf51LtdXhmC7BNXu7sG9PNO;https://drive.google.com/u/2/open?usp=forms_web&id=1LEK4nacUREiln74_gL6M2C2E6qBptCPa;https://drive.google.com/u/2/open?usp=forms_web&id=1qTUBPcyi0qZ1Hsls4K6TsQfZsSlzqMu0;https://drive.google.com/u/2/open?usp=forms_web&id=1tJQVDw3s8UIHPSZumKmYc8V0WDkoLHee",
		"Tagline": null,
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1uJ8IIj4iZckTuqKr3m-2LOsyGqYQRZIb",
		"Benefits": "At UX Society, we invest in our members and take time to give them the necessary tools, knowledge, and experiences they need to become design leaders. Our org is a space for beginners, professionals, and enthusiasts alike - we'll make sure to provide you opportunities for learning to empower and nurture your growth!",
		"Flagships": "FLAGSHIP PROJECTS:\n1) UX&Chill: An online conference wherein User Experience design professionals share about their work and their passion for design and development.\n2) UX University: A case competition to hone members’ problem-solving skills to create human-centered design for the community. \n3) UX Masters: A special event wherein we invite international speakers to give a talk on their career journey from working with small startups to big brands.",
		"Departments": "1) UX Design and Consultancy: The core of UXSoc that advocates the practice of user experience. Handles all client projects in and outside of Ateneo, and creates products that are functional and impactful for our clients. Evangelizes user experience through workshops and learning modules and by training future design leaders.\n2) Engineering: Develops the website projects of UXSoc and its clients both in Front-End and Back-End Engineering, and facilitates workshops and learning modules for anyone who wants to learn about web development in the org.\n3) Events: Designs event experiences that nurture the growth of the members of UXSociety, manages and handles the org's flagship events and helps other departments facilitate their workshops.\n4) Externals: Interacts with organizations and companies inside and outside of Ateneo. Builds connections through partnerships and sponsorships and serves as the bridgeway for students to network with people in the industry.\n5) Finance: Allocates and maximizes the org's funds to continue UXSociety’s mission of evangelizing user experience. Advocates of financial literacy that experience the real-life financial processes of a design firm.\n6) Marketing: Nurtures the identity of the UXSoc and ensures that the org is well represented on all platforms through the org's campaign strategies for content and promotional materials. Makes sure that event and initiative collaterals are aesthetically pleasing and informative at the same time.\n7) Human Resources: The support unit of UXSoc; Organizes projects and initiatives to create an environment where org members can explore, connect, and grow as design leaders.",
		"Facebook": "https://www.facebook.com/UXSoc",
		"SocMed Handles": "Website: https://uxsociety.org/ Instagram: https://www.instagram.com/uxsocietyph/ Twitter: https://twitter.com/uxsocietyph"
	},
	{
		"Representative": "Jerome Isip",
		"Organization": "Blue Symphony Orchestra",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1lXq8r4d2CibzuEkjlC5HkFR2A36crEK6",
		"Description": "The Blue Symphony Orchestra is the pioneering student-led orchestra of the Loyola Schools. Featuring a full symphony orchestra with some of the best instrumentalists in Ateneo, Blue Symphony performs in various concerts both inside and outside the Ateneo community, showcasing both classical and contemporary music. Our performances cover all facets of orchestral production, from arrangement to performance and from lights to sound engineering, Blue Symphony has something for everyone and is open to anyone with a passion for music. Blue Symphony also strives to help instrumentalists of all skill levels improve their skill and musicianship and helps them integrate into the orchestra even without any prior orchestral experience. ",
		"Advocacy": null,
		"Vision": "The Blue Symphony Orchestra envisions itself as a community for Filipino artistry — an organization whose primary focus is the holistic development of its members, deeply rooted in the Ignatian values of service and excellence, through musical performance, production, and arrangement.",
		"Mission": "Our mission is to cultivate awareness and passion for orchestral music within the Ateneo community through the engagement of our audiences in orchestral performances and the growth of our members in all aspects of music competencies and character formation.",
		"Application Process": "When you apply for Blue Symphony, you can apply to be either a performing or non-performing member. Both performing and non-performing members will then join specific departments within Blue Symphony, each with different functions relating to the organization and the orchestra. \n\nFor performing members - While we do not have an audition process, we do have an assessment stage of our application process to help us gauge where you are as an instrumentalist and it lets us find the best way to help you develop as a musician.\n\nFor non-performing members- There are different interviews depending on the different departments within Blue Symphony. These interviews will help us get to know you better and help us assess your skills related to the department.",
		"Featured": "Annual Year-End Concert - As Blue Symphony's flagship project for the year, the year-end concert highlights the best of the best from all aspects of Blue Symphony.  From performance to production, this concert is a culmination of a year's worth of preparation and puts Blue Symphony's best foot forward. \n\nShowcase - Blue Symphony's Showcase is another one of Blue Symphony's concerts that features smaller chamber ensembles to perform different original arrangements by our members. The Showcase helps highlight different individual members' skills while playing in smaller ensembles.\n\nYear-Round Gigs - Blue Symphony performs for different events both inside and outside of the Ateneo community. From weddings to concerts, from Rizal Library to PICC, Blue Symphony performs everywhere, all while showcasing the skill and talent of Blue Symphony's members. ",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1ifJsjlteHhwaIq4yIy4emcYh9w0RNRjP;https://drive.google.com/u/2/open?usp=forms_web&id=1LQIrX1IzuRE8A275G9rC68Tx0-ky9SYh;https://drive.google.com/u/2/open?usp=forms_web&id=1AAkKxah-h5tsCqmiXMIwxQTBeBabdWee",
		"Tagline": "More than an orchestra.",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1bzFwSOMqU4qOMIODco521-fMPUt0rT4d",
		"Benefits": "We offer something for everyone passionate about music. For both instrumentalists and non-instrumentalists, Blue Symphony offers its members the opportunity to develop themselves as musicians and music listeners. From performing to concert production to design,  Blue Symphony has something for everyone, even without any prior orchestral experience. ",
		"Flagships": "Annual Year-End Concert - As Blue Symphony's flagship project for the year, the year-end concert highlights the best of the best from all aspects of Blue Symphony.  From performance to production, this concert is a culmination of a year's worth of preparation and puts Blue Symphony's best foot forward. \n\nShowcase - Blue Symphony's Showcase is another one of Blue Symphony's concerts that features smaller chamber ensembles to perform different original arrangements by our members. The Showcase helps highlight different individual members' skills while playing in smaller ensembles.",
		"Departments": "Composers and Arrangers Pool (CAP) - Members of this department learn how to arrange music for the orchestra, developing skills in both composing and music theory. From classical to contemporary music, members of this department learn how to rearrange music to fit the orchestra. All music that the orchestra plays is goes through this department. \n\nMusic Development Board (MDB) - This department is responsible for overseeing the performing side of Blue Symphony, overseeing rehearsals, sectionals (rehearsals per section) and tracking performer progress throughout the year. This department aims to get performers to reach their highest potential as musicians and instrumentalists.\n\nFinance Department (FIN) - The finance department handles the different day-to-day financial operations of the orchestra, creating the different financial plans that help budget for the different Blue Symphony projects. This also includes managing Blue Symphony's different fundraising projects.\n\nCommunications Department (COMM) - The communications department, in collaboration with the External Relations Department, is in charge of designing Blue Symphony's visual brand image. The department also specializes in creating and designing the promotional materials that are posted on Blue Symphony's social media.\n  \nOperations Department (OPS) - The operations department handles the different production and logistical aspects of Blue Symphony's many performances. These are the people behind-the-scenes that make sure the show runs as smoothly as it can go. Stage lighting, sounds and special projects are just some of the many tasks that the operations department handles.\n \nExternal Relations Department (ExRel) -  The external relations department handles communication between the orchestra and other external partners of the org. From the different sponsors, corporations, partner organizations and stakeholders, the external relations department helps find new partnerships to help the orchestra grow and reach out to new people. This department also handles the social media of Blue Symphony, ensuring that everything posted represents the quality we strive for in the orchestra.\n\nInternal Relations Department (IR) - The internal relations department is in charge of member well-being, ensuring that everyone within the orchestra is well and enjoying their Blue Symphony experience. Some of their tasks include handling member wellness checkups, post-project evaluations and fostering communication between members of the organization with the different officers of the organization through member feedback.",
		"Facebook": "https://www.facebook.com/thebluesymphony/",
		"SocMed Handles": "Twitter - @bluesymph Instagram - @bluesymphorch"
	},
	{
		"Representative": "Kirsten Angeles",
		"Organization": "Effective Altruism Blue",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1jvUpvCxcDE2BFIIdIiRShrTWYdWVHCNo",
		"Description": "Effective Altruism Blue (EA Blue)  is a university chapter for Ateneans interested in Effective Altruism--a philosophy and global movement of people who use evidence and reason to figure out how to help others as much as possible, and take action on that basis.",
		"Advocacy": "Helping Ateneans figure out how to contribute to the most pressing global and local problems, such as global health, animal welfare, climate change, poverty and more.",
		"Vision": "EA Blue envisions itself to be a welcoming, productive, and robust community of Ateneans who use evidence and reason to figure out how to help others as much as possible, and take action on that basis.",
		"Mission": "Our mission is to help our members and the wider community use evidence and careful analysis to think about how they can use their careers and resources to achieve a bigger social impact.",
		"Application Process": "1. Sign up for GA and fill out registration form\n2. Attend GA\n3. Attend interview\n4. Pay registration fee (we will provide different options with flexible deadlines)\na) PHP100 - regular\nb) PHP50 - scholar\n5. Participate in at least two discussion group sessions",
		"Featured": "1. Discussion group - the discussion group is a  four-week program where Atenean students and members of EA Philippines join together to read, study and discuss concepts related to Effective Altruism. \n2. Research with EA Philippines - EA Blue members will be able to take part in research projects led by EA Philippines. (no photo for this)\n3. EA Virtual Conference - EA Blue members have the opportunity to participate in an EA Virtual Conference. This is a gathering of the effective altruism community around the world \n4. EA Socials - EA Blue members will be able to attend virtual social events with other members of EA Blue, and with members of EA Philippines or EA chapters abroad.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=10UdyNbAJJtPvHYRBZa2Tve1CEyvx-WG8;https://drive.google.com/u/2/open?usp=forms_web&id=1TmlUscG7tSD1wTEFWtmtWN22Ek50Zkj0;https://drive.google.com/u/2/open?usp=forms_web&id=1UlALOdUuzZSRP7_eJc2qWPnQo8P27yMv",
		"Tagline": "Using reason and evidence to do the most good.",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1U8hohLqjzkpFPtP9DcpXR_jXzF-UCdFL",
		"Benefits": "\"With limited time and resources, how can I make the greatest positive impact in this world?\" This is a question we ask at Effective Altruism. If you are passionate about helping others, are open-minded and eager to update your beliefs in response to persuasive evidence, and seek to apply evidence and reason to determine the most effective ways to improve the world, EA Blue is a great fit for you.",
		"Flagships": "1. Discussion group - the discussion group is a  four-week program where Atenean students and members of EA Philippines join together to read, study and discuss concepts related to Effective Altruism. \n2. Research with EA Philippines - EA Blue members will be able to take part in research projects led by EA Philippines. (no photo for this)\n3. EA Virtual Conference - EA Blue members have the opportunity to participate in an EA Virtual Conference. This is a gathering of the effective altruism community around the world \n4. EA Socials - EA Blue members will be able to attend virtual social events with other members of EA Blue, and with members of EA Philippines or EA chapters abroad.",
		"Departments": "1. Communication team - the communications team is in-charge of building the organization's brand and helping the organization convey its message. It consists of two pools, the Design Pool (in-charge of creating the org's visual materials) and the Publications Pool (in-charge of the org's written content and statements).\n2. Research team - the Research team will consist of dedicated volunteers interested in contributing to research projects with EA Philippines. \n* other depts to be discussed in GA",
		"Facebook": "https://www.facebook.com/eablue.ph/",
		"SocMed Handles": "Instagram - @eablue.ph"
	},
	{
		"Representative": "Kitchy Dy",
		"Organization": "Habitat for Humanity Blue Chapter",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1PY4aF8nYPCGPvMbl2C1VZ7a-OhHMu553",
		"Description": "Habitat for Humanity Blue Chapter was established in 2015 to aid Habitat for Humanity Philippines and Habitat for Humanity International in reaching its shared vision of a world where everyone has a decent place to live.  We invite people from all walks of life to work together towards the mission of eliminating poverty housing and making decent shelter a matter of conscience and action.",
		"Advocacy": "Habitat for Humanity Blue Chapter works to make decent shelter a matter of conscience and action to help eliminate barriers to adequate and affordable housing. ",
		"Vision": "Habitat for Humanity Blue Chapter envisions a world where everyone has a decent place to live.",
		"Mission": "The Blue Chapter works in partnership with Habitat for Humanity Philippines by sharing their goals to eliminate poverty housing. Seeking to put God’s love into action, Habitat for Humanity Blue Chapter brings people together to build homes, communities, and hope.",
		"Application Process": "1. Application fee\n2. Application form\n3. Interview ",
		"Featured": "Advocacy Month: A month-long project that aims to educate people inside and outside of the organization on issues related to HFH’s advocacy \nHumans of Habitat: A project that features the members of the HFH community to share their story\nHabitat Post: A fundraising project that sells postcards in order to build houses for a partner community",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=126OcQ8HvMK60WWu-W0uep77OBlmaFG9K;https://drive.google.com/u/2/open?usp=forms_web&id=1BzvQJwgLikhc-woDcUffAvnxPDh8SJwO;https://drive.google.com/u/2/open?usp=forms_web&id=1iMSUTRC88IXZpmF3MfJWDaEVcjuQA2xm",
		"Tagline": "Not One Less",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1B5l-iYY5W1ecyTvQdzXDTKpsFPMv8VJx",
		"Benefits": "Today more than ever, the Philippines needs our support in the eradication of poverty housing. Habitat for Humanity Blue Chapter creates direct opportunities for its members to champion decent housing and work towards a more inclusive and sustainable country. As a member, you’ll be provided with avenues to learn more about our advocacy and work on projects that benefit our communities. You’ll see both the internal and external impact of your work, discovering more about yourself and your potential to effect change.",
		"Flagships": null,
		"Departments": "The Internals Department serves as the bridge between the organization and member base. Beyond information dissemination and administrative needs, it takes primary responsibility for member engagement, development, relations, and overall well-being. The department is thus tasked with internal communications, member-focused initiatives, and the implementation of organization-wide systems that overall enhance the member experience and cultivate a working environment centered on growth.\n\nThe Advocacy Department is responsible for educating and advocating the organization’s vision and mission to chapter members, the campus and the greater community about Habitat for Humanity’s mission and its world globally and locally. More than spreading awareness on the pressing issue of eradicating poverty housing, the department ensures that the advocacy is present both within and beyond its projects. Furthermore, the department is tasked with coordinating with its partner communities to discuss, develop, and implement developments in accordance with the needs of every community. \n\nThe Builds Department is responsible for planning volunteer building opportunities and community development activities and putting them into practice for members of the chapter with the local affiliate(s), nonlocal affiliates and sponsored projects of Habitat. The department takes primary responsibility for organizing all building activities, including scheduling volunteers, transportation and all other related tasks with Habitat for Humanity Philippines.\n\nThe Creatives Department is responsible for ensuring that the organization consistently upholds its branding through all promotional materials. The department is also responsible for the overall expression of the advocacy of Habitat for Humanity Blue Chapter to its members and to the public through creative outputs. It oversees the conceptualization of the image of the organization in all of its projects, initiatives, and events through traditional and non-traditional outputs. It also presents these through proper and full documentation.\n\nThe External Relations Department is responsible for reaching out to as many companies and organizations for possible sponsorships and partnerships willing to help spread our advocacy, provide exposure, and extend our help not just within campus but also to our partner communities. It acts as the networking arm of HFH BC, and it handles all concerns and opportunities outside of the organization and its members\n\nThe Finance Department is responsible for ensuring that the organization has sufficient funds for all our builds, projects, & donations. This is done through proper fund management & various fundraising initiatives.",
		"Facebook": "https://facebook.com/HFHAteneo",
		"SocMed Handles": "Instagram: @habitat.bc"
	},
	{
		"Representative": "Aleanna Cordova",
		"Organization": "Christ's Youth in Action - Blue",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1JLmckoIvBoUzQV8RPzB9KBpXK_VKJHfs",
		"Description": "We are a Catholic movement of young Filipinos dedicated to evangelizing the youth and training leaders for the service of the Church.",
		"Advocacy": "To evangelize the youth and train leaders for service to the Church.",
		"Vision": "We envision Filipino Youth who have a growing personal relationship with Jesus Christ, who participate actively in the life and mission of the Catholic Church, and who increasingly become agents of social transformation in society.  Our vision is spelled out in what we may summarize as the 4 C’s of CYA.  Conversion The individual makes a personal commitment to Christ, entering into a new relationship with Him, and making a decision to continue knowing, loving and serving God.  Community The individual participates more actively in the life and mission of the church. He/She also learns the importance of, and thus, commits himself/herself to be part of smaller communities in which there is mutual care, support and opportunity to serve.  Character The individual is formed and grows in Christian character, in his/her understanding of the Catholic faith, and in service to others.  Commission The individual is “sent out” to bear witness to the Gospel by word and example.",
		"Mission": "To evangelize the youth and train leaders for service to the Church.",
		"Application Process": "Christ’s Youth in Action-Blue (CYA-Blue) does not require attendance in specific activities/events to attain membership, and does not conduct a strict application process to join the organization. Attendance in any of the CYA-Blue events automatically considers a student as a member of the organization and becomes added to the member database. Some of the activities they will partake in are GAs, Prayer Meetings, Fellowships and Bible Study sessions.\n",
		"Featured": "> QC Hub Prayer Meeting\nIn collaboration with the other CYA units in the QC Hub (UP Diliman, Miriam College, University of Asia & the Pacific), members from all units come together to praise and worship the Lord and listen to talks and sharings relevant to our growth in our relationships with the Lord, online. \n\n> Fellowships\nIn CYA, we value relationships. Fellowships are ways for our members to relax and bond with one another through games and now, video calls. \n\n> General Assembly\nStudents who are interested in getting to know the organization, whether they signed up in RecWeek or not, are encouraged to attend this event to acquaint themselves with the community and its mission.\n",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1Dr15u90QXfoqd0tV4StpWM-yTfQ_S53P;https://drive.google.com/u/2/open?usp=forms_web&id=12-l3w7lNIaF5yoBtinkuCjEWmSJdbHiX;https://drive.google.com/u/2/open?usp=forms_web&id=1t3HE2wSGEsHvHJA1aCYpDLg4XW0p3JNr;https://drive.google.com/u/2/open?usp=forms_web&id=1dX3ZHXNz9ECYwIFef6pf41pYcpQmqOxX",
		"Tagline": "Kay Kristo Buong Buhay Habambuhay!",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=18gOQgdwnXJDkeRnjapruI2htp3FYijZ9",
		"Benefits": "In CYA, you will find a family. Brothers and sisters are not limited with your family members or orgmates, CYA goes beyond the school and country. We believe that encountering God is the greatest adventure one can set out for.",
		"Flagships": "Not finalized yet given the new platform. ",
		"Departments": "Our org is only composed of the Service Council (Se-Co). Although we have many projects and activities as a unit and in collaboration with other QC units (UP-Diliman), we have an appointment system in creating the team. ",
		"Facebook": "https://www.facebook.com/cya.admu",
		"SocMed Handles": null
	},
	{
		"Representative": "Joaquin Lapuz",
		"Organization": "League of Atenean Historians (LAHi)",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1NhngZyD-6261omW91vyI-f2IW6B0TW1v",
		"Description": "The League of Atenean Historians (LAHi) is a place for enthusiasts of all types of history! LAHi believes in showing others that history is a part of everyday life and something that can expand a person's view of the world. Therefore, non-history majors are welcome to join as well.",
		"Advocacy": "Freedom of Information and Appreciation of History In Daily Life",
		"Vision": "To transform the students of the Ateneo de Manila University from passive observers to cultural advocates and nation builders grounded in historicity, to contribute to the increased awareness and enrichment of the identity of the Filipino nation. Furthermore, it seeks to develop an appreciation of Philippine history in the bigger context of global history.",
		"Mission": "The League of Atenean Historians shall serve as an important link between the Department of History and its majors, aiding in their development as responsible historians that will contribute in enriching the identity of the Filipino nation. As an Atenean organization guided by the Ignatian value of being men and women for others, God, and nation, the League of Atenean Historians shall provide projects, activities, and learning experiences that will instill in its members a sense of importance for the past, a vision for the future, and the enrichment of the present. ",
		"Application Process": "Online Sign-Up\nStudents interested in joining the organization would sign up at the designated link or app during LIONS RecWeek. Once the student has finished the sign-up sheet and submitted it, they will then be considered an official member of LAHi. Not long after signing up, they would also be added to the org’s Members Facebook group.\n\nIC with a Member of Core\nAfter the sign-up process, the applicant would then need to schedule an individual consultation with one of LAHi's Core officers, so that the applicant can get to introduce themselves as well as get to know some of their respective org mates before the General Assembly.\n\nGeneral Assembly (GA)\nApplicants are required to attend the General Assembly, as this is where LAHi Core explains in-depth what the org is and how it is structured. This is also where the officers would introduce themselves and discuss plans for the org moving into the semester.\n\nDepartment Sign-Up\nAll members of the organization are meant to be under at least one of LAHi’s Departments (Research & Writing, Public Relations, Human Resources, or Projects). At the end of the GA, a signup sheet will be released in the Members Facebook group that members will need to fill out by the designated deadline. Each department has its own prerequisites for joining, with some requiring individual consultation. It is the member’s responsibility to send organize their prerequisites and/or individual consultation.\n\nDepartment GA\nThe Department GA focuses specifically on the functions of the different departments in LAHi. While the standard General Assembly provides a general introduction to those departments, this one aims to clarify what a member under this Department would do and how they would work with their respective Head and Deputy.",
		"Featured": "Past Meets Present \nAre you a trivia fanatic? Do you love knowledge and aren't afraid to show it? Well look no further than Past Meets Present! Past Meets Present is a quiz bee tournament that asks its players various questions from different fields of history, ranging from Greece & Rome to China & Korea, with pop culture topics like film and video game history thrown in as well. With tons of prizes for the winning team, get together with friends, and show your stuff!\n\nHistorical Sites & Museum Field Trips \nHave you ever wanted to visit museums around Metro Manila and Luzon? Have you ever wondered what happened to some of the places affected by different world events? LAHi's got you covered! Join us as we visit different places in the Philippines to learn the stories that these places have to tell!\n\nHistory Talks\nHave any questions that your history classes don't cover? Are you interested in hearing about the stories of people that have taken part in large historical events? Or are you just curious about the weird and funny stories about people from long ago? LAHi's got you covered here too! We've got talks from Ateneo's Department of History that scratch that history buff itch! ",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1S8S-w0cny2NShiE6fXMiZEtAfCkRlXm_;https://drive.google.com/u/2/open?usp=forms_web&id=1fna8pUckzUj4APHfC9pBMSCgO8YnGlYW;https://drive.google.com/u/2/open?usp=forms_web&id=1UFhfjU7KukYsIkINNdbu5WgDjXZfcw2v",
		"Tagline": "Make History Your Story!",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1O4QJea5qg1wyoVf5J-P5ccbo8_0yOqFa",
		"Benefits": "The League of Atenean Historians (LAHi) is a place for enthusiasts of all types of history! If you know a lot about history and you want to talk about it with other passionate history buffs, or are curious about learning about unconventional and weird stories in history, then LAHi is the place for you!  LAHi believes in showing others that history is a part of everyday life and something that can expand a person's view of the world. Therefore, non-history majors are welcome to join as well.",
		"Flagships": "Past Meets Present\nAre you a trivia fanatic? Do you love knowledge and aren't afraid to show it? Well, look no further than Past Meets Present! Past Meets Present is a quiz bee tournament that asks its players various questions from different fields of history, ranging from Greece & Rome to China & Korea, with pop culture topics like film and video game history thrown in as well. With tons of prizes for the winning team, get together with friends, and show your stuff!",
		"Departments": "Research & Writing\nThe Research & Writing (R&W) Department is the arm of LAHi that is responsible for many of the org's activities that involve some type of academic research. Projects like these include Seriously Trivial (LAHi's weekly historical trivia initiative), and creating the questions that are used in LAHi's flagship project, the Past Meets Present Quiz Bee. It is the backbone of LAHi's advocacy for freedom of information, making sure that whatever is put out in LAHi's name is done using reputable sources.\n\nProjects\nLAHi's Projects Department is in charge of the management of the various org projects that may be going on at a time. It coordinates between the different LAHi departments to make sure that a project is happening on schedule, as well as communicating with the Office of Student Activities (OSA) to make sure projects are approved by the university. Projects often spearheads the org's flagship project, the Past Meets Present Quiz Bee and is normally the primary source of manpower for said projects.  \n\nPublic Relations\nPublic Relations (PR) is the department in LAHi that deals with the org's social media engagement, being in charge of posting the org's various activities. It also deals with communication between the Ateneo Department of History, other student organizations & outside sponsors. Under the PR Department is also the org's Creatives, who are in charge of the creation & design of promotions for org events.\n\nHuman Resources\nHuman Resources (HR) is the division of LAHi that focuses on finding, screening, recruiting, and training org members, as well as initiating projects that help foster a positive org culture. HR's goal is for LAHi's members to have a great experience and to get the holistic development that can help fulfill the org's mission and vision.\n\n",
		"Facebook": "https://www.facebook.com/lahionline/",
		"SocMed Handles": "Twitter: @lahionline, Instagram: @lahionline"
	},
	{
		"Representative": "Jazzy Reyes",
		"Organization": "CASA",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1WyzRxML4lF18zLgh1qOrGyVW8JwnSV_9;https://drive.google.com/u/2/open?usp=forms_web&id=1hfJvGBiia46hhUghi5-nsUM3BYwf-mp2",
		"Description": "As the Philippines' premier collegiate pop a cappella group, CASA strives to release life into the world through the music of our voices.",
		"Advocacy": "CASA as a home for people passionate about music",
		"Vision": "Striving to always being prepared in facing any kind of situation that comes our way.",
		"Mission": "We turn hardships into inspiration while fulfilling each member's passion.",
		"Application Process": "Performers - Auditions\nArrangers - Portfolio Submission\nCreatives & DnP - Portfolio Submission\nProduction - No additional process",
		"Featured": "Open Mic Night\n> CASA’s Open Mic Night is open to all\ntypes of performers who wish to share their talents with other people. The transition to the online platform will enable all performers (both from our own organization and outside) to reach a wider audience and share their love for the arts.\n\nCaroling\n> As CASA's favorite holiday, we believe there is no better way to feel the spirit of Christmas than through singing; and it is our job to help reminisce all your favorite contemporary Christmas songs.\n\nHarana\n> CASA is bringing back the times of serenading your loved ones but as you guessed it, we’re going online! We’ll be taking requests from people who want us to perform a song for the special person or people in their life!\n\nGrand Concert\n> Our grand concert serves as a culmination of everything we built this year. This project is the perfect opportunity for all the members to really shine and showcase their different talents to all!",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1kt9EAiiIcnkubZXorggRLx96MplXUxrb;https://drive.google.com/u/2/open?usp=forms_web&id=1_U6PGX1Xr5xJYipnT43pHePLImhjYc1t;https://drive.google.com/u/2/open?usp=forms_web&id=1vkrjKP4BwEgNn8igKKfV83ETMrE7eVqd",
		"Tagline": null,
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1FdFnT3muzXLQKpLFXq1k95q-VDGva22-",
		"Benefits": "- We are an org where our focus is on the sense of passion and the sense of community not in balance but in complete harmony\n\n- As diverse as our own individual taste in music, we confidently boast being \"evenly odd\" as our own individual traits complement each other for our love to sing\n\n- Singing in a cappella, as the singer harmonizes with others, is truly a life-giving experience of connection",
		"Flagships": "Open Mic Night\n> CASA’s Open Mic Night is open to all\ntypes of performers who wish to share their talents with other people. The transition to the online platform will enable all performers (both from our own organization and outside) to reach a wider audience and share their love for the arts.\n\nCaroling\n> As CASA's favorite holiday, we believe there is no better way to feel the spirit of Christmas than through singing; and it is our job to help reminisce all your favorite contemporary Christmas songs.\n\nHarana\n> CASA is bringing back the times of serenading your loved ones but as you guessed it, we’re going online! We’ll be taking requests from people who want us to perform a song for the special person or people in their life!\n\nGrand Concert\n> Our grand concert serves as a culmination of everything we built this year. This project is the perfect opportunity for all the members to really shine and showcase their different talents to all!",
		"Departments": "Performers, Arrangers, Creatives, DnP, Production (FoH, Stage Manager, Sounds, Lights)",
		"Facebook": "https://www.facebook.com/musikaCASA/",
		"SocMed Handles": "Instagram: @musikacasa"
	},
	{
		"Representative": "Francine Mae Mamba",
		"Organization": "Loyola Gaming",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1pz0kU0k4HooMupQazBaESQ_TREy_Gcbm",
		"Description": "Loyola Gaming is an organization primed to be the forerunner of collegiate games and esports development and the home for any and all Atenean gamers. As champions of the belief that the merits of games go far beyond the play, members of Loyola Gaming are given a myriad of enriching opportunities for skills development, community interaction, spirited competition, and so much more.",
		"Advocacy": "Loyola Gaming abides earnestly to the view of gaming as a gateway to the holistic development of character and that, beyond the aspect of play, video games may lend themselves as space to develop key competencies such as problem solving, innovation, and collaboration; ultimately as an avenue to bring out the best of oneself.",
		"Vision": "Loyola Gaming seeks to channel the gaming industry’s untapped and uncharted potential to be a positive driving force in a modern digital society.",
		"Mission": "Loyola Gaming aims to foster a community of gamers, both within a collegiate setting and beyond, as a sterling example of the positive impacts gaming has to offer. ",
		"Application Process": "Recruitment Week Registration, (optional) Tryouts for LG Esports Teams",
		"Featured": "Partnered Streamers Program: As a continuation to the “LVL Streamers” program, the organization will continue with another round of its games streaming workshop wherein members are empowered to further share and develop their talents inside and outside of the organization. At the end of the workshop, top picks will be selected as “partnered streamers” and receive significant benefits such as dedicated stream assets, access to main social media channels, and so much more.\n\nEnd-of-Semester Invitational (ESI): A flagship competition held biannually within the Loyola Schools that pits representative teams of the various Ateneo organizations against one another for the chance to flex their gaming prowess and org pride.\n\nLG Esports Tryouts: Our team, LG Esports, has grown to be one of the highest-tier competitive teams in the collegiate esports scene. Members are given the chance to try out for the representative teams for various Esports titles like League of Legends, DotA 2, Hearthstone, Valorant, and Mobile Legends.\n\nCommunity Events: From weekly Discord hangouts, to friendly competitions, and a dedicated Minecraft server, the organization aims to further bring together the community in this time of social distancing through various in-game, online, and IRL activities.\n\nTalks and Workshops: In partnership with Esports AcadArena and Ateneo’s Department of Information Systems and Computer Science, the organization will be conducting various workshops and classes that will allow students to gain insight into the different aspects of the gaming industry and better educate the gaming community of the world of games and its possible opportunities.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1yJpR109J4yehiaHXkCiXoq65DRlyxSvY;https://drive.google.com/u/2/open?usp=forms_web&id=1IVkqxustMye3HWDrkkakDPkJnHDXgRQj;https://drive.google.com/u/2/open?usp=forms_web&id=1OtxJV9-iMhkoxxSzQYdD3HYMzfS8RiEZ;https://drive.google.com/u/2/open?usp=forms_web&id=19sz6tRJLpCAk1S4ccHIvXHiX6LY6B76F;https://drive.google.com/u/2/open?usp=forms_web&id=1cJ0sr9f-sEdjQa0ejr7jw5-52b5cy8iQ",
		"Tagline": "To Follow",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1Qjynkx3TRVuX5Okg08SCkbfbOLUYe9Mb",
		"Benefits": "To Follow",
		"Flagships": "To Follow",
		"Departments": "To Follow",
		"Facebook": "https://www.facebook.com/loyolagaming/",
		"SocMed Handles": "To Follow"
	},
	{
		"Representative": "Miguel Lorenzo Uygongco",
		"Organization": "Developer Student Clubs - Loyola",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1O9LceACSA7NL_nT42qmL8UBfzdvFQ74j",
		"Description": "Developer Student Clubs Loyola is a student organization in the Ateneo de Manila University powered by Google Developers that aims to build students’ skills and network by giving them access to different technologies, specifically Google Developer technologies like Android, Firebase, Angular, Flutter, Google Cloud Platform and many more. Together, we learn in a peer-to-peer learning environment and build solutions for the community.",
		"Advocacy": "Uplifting communities through technology",
		"Vision": "We are a community of developers that are passionate about uplifting communities through technology and innovation.",
		"Mission": "Empower. Enlighten. Nurture",
		"Application Process": "Application submission < Interviews < Final deliberation",
		"Featured": "DSC Events Description:\n1. Cloud Study Jams: A series of workshops with topics ranging from Machine Learning, BigQuery, to Kubernetes. These workshops are tailored to fit members’ diverse skill levels and aims to provide them with practical knowledge on Google Cloud Technology.\n2. Tech at Home: A student-led online technology seminar series that teaches new technologies, especially Google technologies to a wide and diverse audience.\n3. Eagle Hacks: A week-long series of workshops and seminars, culminating in a two-day hackathon where students can exercise their skills in software development while making an impact on society.",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1S6XXZdoW0aL03IhGWflBDUuEsfolnF8e;https://drive.google.com/u/2/open?usp=forms_web&id=1vSNcAEgkSVBauGyTlMV0mZmVh4hz9DHK;https://drive.google.com/u/2/open?usp=forms_web&id=1mji6taIjeo0ffMlcKarrPFBP-LVh6Ndu;https://drive.google.com/u/2/open?usp=forms_web&id=1b1dUFvQM3zRqaihRWKFW1b6DQrFCbZHk",
		"Tagline": "Uplifting communities through technology",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1FXYhVZ8M-9Gp0hcSBgq-OHCkfNZz3VjB",
		"Benefits": "We believe that DSC Loyola is one of the organizations that thrive amidst this pandemic. With this, we can be able to help bridge the gap that the Loyola Schools and organizations lack with solutions that we can help provide the Ateneo community",
		"Flagships": "1. Tech at Home: A student-led online technology seminar series that teaches new technologies, especially Google technologies to a wide and diverse audience.\n2. Eagle Hacks: A week-long series of workshops and seminars, culminating in a two-day hackathon where students can exercise their skills in software development while making an impact on society.",
		"Departments": "Human Resources - The Human Resources department is the community builder of the organization. The department assesses the performances of the members and encourages an environment that is collaborative and growth-minded, while also strengthening the organization's relationships with community partners.\nFinance - The Finance and Externals Department is the funding and partnerships arm of DSC Loyola. The department manages the organization's funds making sure there is always enough financial resources for its projects and activities. It also builds strong relationships with various institutions, such as businesses, schools, and organizations.\nTechnology - The Technology department is a group of passionate students that are responsible for the planning, design, and implementation of various activities such as Workshops and Client/Internal projects in different aspects of software and technology namely: Web Design, Mobile App Development, UX/UI, AI, ML, Data Science, and Cloud Engineering\nCommunications - The Communications Department is in charge of planning, developing, and implementing the marketing and communication strategies of the organization\nOperations - The Operations is the internals manager of the organization. The department oversees and ensures that the events and initiatives are well delivered and successful.",
		"Facebook": "https://www.facebook.com/dscloyola",
		"SocMed Handles": "Twitter - @DSCLoyola; IG - @dsc.loyola; LinkedIn - Developer Student Clubs - Loyola"
	},
	{
		"Representative": "Clio Banta-ao",
		"Organization": "AGILA",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1TF8ZsR-gBf1lN_SX1L2gub4AQn3MEV27",
		"Description": "AGILA is an organization made up of Ateneans that creates an avenue for their passion for animals. It aims to promote Animal Welfare to the Atenean community, its students and employees, by lighting the spark of each individual's love for animals which will, in return, help our furry friends in and outside the campus.",
		"Advocacy": "AGILA is an organization that advocates for Animal Welfare and tries to raise awareness about it through the organization’s projects and overall presence as an org.",
		"Vision": "We, AGILA, envision a society that respects and advocates Animal Welfare. We aim for all animals to be ensured with caring homes and overall well-being.",
		"Mission": "AGILA seeks to provide an avenue for Ateneans to advocate Animal Welfare through awareness campaigns and sustainable action. It seeks to instill members with compassion for animals and to equip them with the skills necessary for nurturing life. ",
		"Application Process": "1) Fill out the application form: \n2) Check your email regarding the status of your application\n3) Like the AGILA page\n4) Join the group for organization briefing announcements\n",
		"Featured": "Webinars\nThese webinars will be in line with our advocacy of informing others about Animal Welfare and how to achieve it.\n\nPets of Ateneo (tentative name)\nThis project aims to boost social media engagement by asking for stories from pet owners to be shared on our page where people can relate and be inspired to share as well.\n",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1AmoLbY6sK07lm51mL4COLpO4q30Sahyb;https://drive.google.com/u/2/open?usp=forms_web&id=1hLwidG4zmf5PivlXqTMk7DC-2h9N7Ig2;https://drive.google.com/u/2/open?usp=forms_web&id=18PL_CKiEpRp3cJng9QFN1heyXDPGSjpS;https://drive.google.com/u/2/open?usp=forms_web&id=18m4Zw8aVKpqzS7XZ0T1mbBjuSMnC6bAi",
		"Tagline": "Your partner for animal welfare",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=15wNbmxyMt3C3yanGZxwPsqxqK6kEbAR_",
		"Benefits": "If you’re an animal lover or just want to see our furry friends living their best fur life, we will make sure that your love and care will not go to waste. Everything we do here in AGILA is for the benefit of our furry friends in order for them to find their forever homes.",
		"Flagships": "AGILA Week\nThis is a week-long event that aims to advocate Animal Welfare through various activities such as donation drives, talks, and many more.\n\nShelter Visits\nThe Animal Rescue Center visit or Shelter visit is a session at a partner organization where members can help out in the daily activities of an animal shelter or rescue center. (due to COVID 19, this may not be possible)\n",
		"Departments": "Animal Management: \nThe Animal Management Department is in charge of rescuing, fostering, and adopting out animals that are reported to AGILA as well as bringing these animals to the vet for appointments. \n\nCommunications Department: \nThe Communications Department is in charge of the creative aspects of the organization. They are the people behind the posters and pictures that are posted and make sure that the branding of AGILA is shown in each pubmat.\n\nExternal Relations Department: \nThe External Relations Department is in charge of fostering partnerships with other organizations that have the same advocacy as AGILA as well as looking for people or companies that are willing to sponsor the activities of the organization from vet bills to projects. \n\nFinance Department:\nThe Finance Department is in charge of generating funds for the organization’s use and works with the Communications Department with the management of the merchandise. \n\nHuman Resources Department: \nThe Human Resources Department is the one in charge of maintaining the well - being of the members of the organization. They are also in charge in making sure member engagement is going well.\n",
		"Facebook": "https://www.facebook.com/AteneanAgila",
		"SocMed Handles": null
	},
	{
		"Representative": "JJ Agcaoili",
		"Organization": "DECO",
		"Org Logo (PNG)": "https://drive.google.com/u/2/open?usp=forms_web&id=1xWDbRemY27wBBVOmcKKrbXDGEKL7nMpg",
		"Description": "Deco is the home for graphic designers in the Ateneo.",
		"Advocacy": "Deco upholds design excellence and advocates for the fair and ethical practice of graphic design.",
		"Vision": "Deco wants to see a flourishing designer community in Ateneo where design is respected as a craft and designers are united in mutual growth and development.",
		"Mission": "We aim to create a thriving designer community and network in Ateneo, provide designers with substantial resources, support, and opportunities, train and develop creative and professional designers, and stimulate good design within the university.",
		"Application Process": "One quick interview, that's all!",
		"Featured": "1) Digital Hangouts\n2) Designer Support\n3) Portfolio Creation\n4) Portfolio Review\n5) Design Workshops",
		"Photos for each event": "https://drive.google.com/u/2/open?usp=forms_web&id=1e4o-se0Lh9_aAavnUk0ojkmSigQVJyqD;https://drive.google.com/u/2/open?usp=forms_web&id=1pJyx2qE3zZBzbcN805z5c9yHxGDO5bd-;https://drive.google.com/u/2/open?usp=forms_web&id=14dOCtNuc05nRQFL4bw9-EyQZv8NJ49kg;https://drive.google.com/u/2/open?usp=forms_web&id=1gIQoW-8N1H_gF3N4m6dA76DqjDhPiErN;https://drive.google.com/u/2/open?usp=forms_web&id=1VUI0W-WucdQmnN8_EZ-W9Jsf05WFYIUg",
		"Tagline": "Your home for graphic designers. ",
		"Org Photo": "https://drive.google.com/u/2/open?usp=forms_web&id=1J8YhVuIZehuLaZneX7me1gS6_C7-hxZo",
		"Benefits": "Join a community of visual junkies who love posters, vectors, logos, brands, and anything artsy and graphic design related!",
		"Flagships": "1) Design Hangouts\n2) Designer Support\n3) Design Review",
		"Departments": "Think of this org like one giant design team. You can also join in to help out in community management, external relations, and operations!",
		"Facebook": "https://www.facebook.com/deco.designercommunity",
		"SocMed Handles": null
	}
]
